mattehicks/SCDE/components/ESP32_TouchGUI1_Module/ESP32_TouchGUI1_Module.c
/* #################################################################################################
 *
 *      Name: ESP32_SPI Module
 *  Function: This is used to set up GPIOs as a switch with the goal to control switching hardware
 *            (relay, ...). The GPIO switching is Hardware PWM driven (for ESP32 SOC only). 
 *            Module for use with SCDE (Smart Connected Device Engine) only !
 *
 *  ESP 8266EX & ESP32 SoC Activities ...
 *  HoME CoNTROL & Smart Connected Device Engine Activities ...
 *  Copyright by EcSUHA
 *
 *  Created by Maik Schulze, Sandfuhren 4, 38448 Wolfsburg, Germany for EcSUHA.de 
 *
 *  MSchulze780@GMAIL.COM
 *  EcSUHA - ECONOMIC SURVEILLANCE AND HOME AUTOMATION - WWW.EcSUHA.DE
 * #################################################################################################
 *
 *
 */


//define mySPI ESP32_SPI KEY=ARG
#include "stdatomic.h"

#include <ProjectConfig.h>
#include <esp8266.h>
#include <Platform.h>

// the Smart-Connected-Device-Engine structures & types ..
#include <SCDE_s.h>

// provides WebIf, need the structures & types ...
#include "WebIf_Module.h"
#include "ESP32_SPI_Module_s.h"

// this Modules structures & types ...
#include "tft.h"
#include "ESP32_TouchGUI1_Module_s.h"
#include "ESP32_TouchGUI1_Module.h"



//#include "SCDE_Main.h"
//#include "driver/gpio.h"



// ptr zur Fehlermeldung in allokierter strTextMultiple_t WENN NOCH KEIN FEHLER WAR
#define SCDE_OK  NULL

/*
static const char* I2S_TAG = "I2S";
#define SCDE_CHECK(a, str, ret) if (!(a)) {                                              \
        ESP_LOGE(I2S_TAG,"%s:%d (%s):%s", __FILE__, __LINE__, __FUNCTION__, str);       \
        return (ret);                                                                   \
        }
//  I2C_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);
*/



// SCDE_CHECK MAKRO: Prüft Bedingung und gibt Fehler in allokierter strTextMultiple_t zurück
#define SCDE_CHECK(a, str) if (!(a)) {							\
	retMsg = malloc(sizeof(strTextMultiple_t));					\
	retMsg->strTextLen = asprintf(&retMsg->strText					\
		,"Error! '%s'"								\
		,str);									\
	return retMsg;									\
	}





// macro to CHECK, if FALSE -> load error msg in strTextMultiple_t and return
#define SCDE_CHECK_LOAD_ERROR_TEXT_GOTO(a, str, dest) do {			\
  if (!(a)) {									\
	/* alloc mem for retMsg */						\
	p_retMsg = malloc(sizeof(strTextMultiple_t));				\
										\
	/* response with error text */						\
	p_retMsg->strTextLen = asprintf(&p_retMsg->strText			\
		,"Parsing Error! %s(%d): %s!",					\
		__FUNCTION__, __LINE__, str);					\
	goto dest;								\
  }										\
} while(0)






// -------------------------------------------------------------------------------------------------

// set default build verbose - if no external override
#ifndef ESP32_TouchGUI1_Module_DBG  
#define ESP32_TouchGUI1_Module_DBG  5	// 5 is default
#endif 

// -------------------------------------------------------------------------------------------------



#include <WebIf_EspFSStdFileTX.h>
#include <WebIf_EspFSAdvFileTX.h>

#include "HTools_cgi.h"
#include <ServAPCfg_tpl.h>
#include <CGI_Redirect.h>



// -------------------------------------------------------------------------------------------------



/*
 * Implemented Values for Keys
 */

// ESP32_TouchGUI1_SET_DISENA -> 'SDA_IO_PULLUP' -> Disabled|Enabled
//                             -> 'SCL_IO_PULLUP' -> Disabled|Enabled
SelectAData ESP32_TouchGUI1_DisEna[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"Disabled"},
  {1,"Enabled"}, 
  {0, NULL}
  };

// ESP32_TouchGUI1_SET_I2C_MODE -> 'I2C_MODE' -> Master|Slave
SelectAData ESP32_TouchGUI1_I2C_MODE[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"Master"},
  {1,"Slave"}, 
  {0, NULL}
  };

/*
// ESP32_TouchGUI1_SET_IDLE_LV -> 'IDLE_LV' -> Low|High
SelectAData ESP32_TouchGUI1_LoHi[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"Low"},
  {1,"High"}, 
  {0, NULL}
  };
// ESP32_TouchGUI1_SET_BLOCK -> 'PWM_BLOCK'-> High_Speed|Low_Speed
SelectAData ESP32_TouchGUI1_PWM_BLOCK[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"High_Speed"},
  {1,"Low_Speed"},
  {0, NULL}
  };
// ESP32_TouchGUI1_SET_TICK_SOURCE -> 'TICK_SOURCE'-> REF|APB_SLOW
SelectAData ESP32_TouchGUI1_TICK_SOURCE[] = {  //ID, Text MAX CGI LEN BEACHTEN!!!
  {0,"REF"},
  {1,"APB_SLOW"}, 
  {0, NULL}
  };
*/



/**
 * For Type: ESP32_SPI
 * Implemented-Args-Keys, for input (MAX 64!). //IAK!!
 * KEYs-Field-Set for Feature specific query. Will be generated by SCDEH_ParseStrToparsedKVInput()
 * parsed result is stored in ESP32_TouchGUI1_parsedKVInput_t
 */
enum ESP32_TouchGUI1_SET_IK {				// Bit #XX for debugging

  // Block #1 I2C Block to use
    ESP32_TouchGUI1_SET_I2C_NUM			// Bit #01 'I2C_NUM' -> 

  // Block #2 I2C Master/Slave ?
  , ESP32_TouchGUI1_SET_I2C_MODE			// Bit #02 'I2C_MODE' -> 

  // Block #3 I2C Pin connections
  , ESP32_TouchGUI1_SET_SDA_IO				// Bit #03 'SDA_IO' -> 
  , ESP32_TouchGUI1_SET_SDA_IO_PULLUP			// Bit #04 'SDA_IO_PULLUP' -> 
  , ESP32_TouchGUI1_SET_SCL_IO				// Bit #05 'SCL_IO' ->
  , ESP32_TouchGUI1_SET_SCL_IO_PULLUP			// Bit #06 'SCL_IO_PULLUP' ->

  // Block #4 I2C Pin connections
  , ESP32_TouchGUI1_SET_MASTER_CLOCK			// Bit #07 'MASTER_CLOCK' ->

  // Block #5 I2C Pin connections
  , ESP32_TouchGUI1_SET_SLAVE_10BIT_ENA		// Bit #08 'SLAVE_10BIT_ENA' ->

  // Block #6 I2C Pin connections
  , ESP32_TouchGUI1_SET_SLAVE_ADRESS			// Bit #09 'SLAVE_ADRESS' ->

// end marker
  , ESP32_TouchGUI1_SET_NUMBER_OF_IK			// Bit #10 MAX 64 IMPLEMENTED !

};

 

/**
 * For Type: ESP32_SPI
 * Implemented readings (MAX 32!)
 * Can be assigned to Implemented Keys, if affected
 */
enum ESP32_TouchGUI1_Readings {			// Bit #XX for debugging

   ESP32_TouchGUI1_R_DUTY		= (1<<0)	// Bit #00 'Duty'  -> 

  ,ESP32_TouchGUI1_R_RESOLUTION	= (1<<1)	// Bit #01 'Resolution' -> 

  ,ESP32_TouchGUI1_R_NAME		= (1<<2)	// Bit #02 'name' + caps + ufid -> 

