mattehicks/SCDE/components/ESP32_TouchGUI1_Module/ESP32_TouchGUI1_Module.c
  };



// -------------------------------------------------------------------------------------------------



/*
 * DName: ESP32_TouchGUI1_Fn (SCDE Functions)
 * Desc: Stores function callbacks provided & made accessible for client modules using this module,
 *       for operation and helpers
 * Data: 
 */
/*
ESP32_TouchGUI1_Fn_t ESP32_TouchGUI1_Fn = {
  ESP32_TouchGUI1_Module_TouchGUI1_bus_add_device,
  ESP32_TouchGUI1_Module_TouchGUI1_bus_remove_device
};
*/



/**
 * -------------------------------------------------------------------------------------------------
 *  DName: ESP32_TouchGUI1_provided_Fn
 *  Desc: Assigns common + custom functions this Module provides to the SCDE (and client Modules)
 *  Data: ESP32_TouchGUI1_provided_fn_t
 * -------------------------------------------------------------------------------------------------
 */
ESP32_TouchGUI1_ProvidedByModule_t ESP32_TouchGUI1_ProvidedByModule = {   // A-Z order
{
// --- first the common module functions ---
  "ESP32_TouchGUI1"	// Type-Name of module -> on Linux libfilename.so !
  ,15					// size of Type-Name

  ,NULL					// Add
  ,ESP32_TouchGUI1_Attribute		// Attribute
  ,ESP32_TouchGUI1_Define		// Define
  ,NULL					// Delete
  ,NULL					// DirectRead
  ,NULL					// DirectWrite
  ,NULL					// Except
  ,NULL					// Get
  ,ESP32_TouchGUI1_IdleCb		// IdleCb
  ,ESP32_TouchGUI1_Initialize		// Initialize
  ,NULL					// Notify
  ,NULL					// Parse
  ,NULL					// Read
  ,NULL					// Ready
  ,NULL					// Rename
  ,ESP32_TouchGUI1_Set			// Set
  ,ESP32_TouchGUI1_Shutdown		// Shutdown
  ,NULL					// State
  ,NULL					// Sub
  ,ESP32_TouchGUI1_Undefine		// Undefine
  ,ESP32_TouchGUI1_Write		// Write
  ,NULL					// FnProvided
  ,sizeof(ESP32_TouchGUI1_Definition_t)	// Modul specific Size (Common_Definition_t + X)
},
// --- now the custom module fuctions ---
  // NONE				// ?
};



/* -------------------------------------------------------------------------------------------------
 *  FName: Attribute Fn
 *  Desc: Informs an 'definition' of this 'module' for 'attribute' activities (set/delete)
 *  Info: 'attr_cmmand' is the command for the activity: set, delete
 *        'attr_name' is the attribute name
 *        'attr_value' is the attribute value
 *  Para: Common_Definition_t* p_entry_definition -> the 'definition' identified for the activities
 *	  const String_t attr_command -> the attribute-command
 *	  const String_t attr_name -> the attribute-name
 *	  const String_t attr_value -> the attribute-value
 *  Rets: Entry_String_t* -> = SCDE_OK (no ret msg) or VETO (SLTQ Entry_String_t* with ret msg)
 * -------------------------------------------------------------------------------------------------
 */
Entry_String_t* ICACHE_FLASH_ATTR
ESP32_TouchGUI1_Attribute(Common_Definition_t* p_entry_definition,
	 const String_t attr_command,
	 const String_t attr_name,
	 const String_t attr_value)
{
  // make common ptr to modul specific ptr
  ESP32_TouchGUI1_Definition_t* p_entry_esp32_touchgui1_definition =
		  (ESP32_TouchGUI1_Definition_t*) p_entry_definition;

  // to store the ret_msg. SCDE_OK = no msg 
  Entry_String_t* p_entry_ret_msg = SCDE_OK;

// -------------------------------------------------------------------------------------------------

  #if ESP32_TouchGUI1_Module_DBG >= 5
  SCDEFn_at_ESP32_TouchGUI1_M->Log3Fn(p_entry_esp32_touchgui1_definition->common.name,
	p_entry_esp32_touchgui1_definition->common.nameLen,
	5,
	"Attribute Fn (Module '%.*s') is called with args: "
	"attr_command '%.*s' attr_name '%.*s' attr_value '%.*s'",
	p_entry_esp32_touchgui1_definition->common.module->provided->typeNameLen,
	p_entry_esp32_touchgui1_definition->common.module->provided->typeName,attr_command.len,
	attr_command.p_char,
  	attr_name.len,
	attr_name.p_char,
	attr_value.len,
	attr_value.p_char);
  #endif

// ------------------------------------------------------------------------------------------------

  return p_entry_ret_msg;
}









/*
#include "freertos/ringbuf.h"


#include "soc/i2c_struct.h"
#include "soc/i2c_reg.h"
#include "driver/periph_ctrl.h"

static const char* I2C_TAG = "i2c";

#define I2C_CHECK(a, str, ret)  if(!(a)) {                                             \
        ESP_LOGE(I2C_TAG,"%s:%d (%s):%s", __FILE__, __LINE__, __FUNCTION__, str);      \
        return (ret);                                                                   \
        }

*/






// to device
#define PIN_NUM_CS   5		// Display CS pin
#define PIN_NUM_DC   26		// Display command/data pin

//This function is called (in irq context!) just before a transmission starts. It will
//set the D/C line to the value indicated in the user field.
void 
lcd_spi_pre_transfer_callback(ESP32_SPI_transaction_t* t)
{
//  printf("pre........\r\n");
  int dc = (int) t->user;
  gpio_set_level(PIN_NUM_DC, dc);
}

void 
lcd_spi_post_transfer_callback(ESP32_SPI_transaction_t* t)
{
// printf("post.......\r\n");
//    int dc = (int) t->user;
//    gpio_set_level(PIN_NUM_DC, dc);
}


/*
uint32_t 
lcd_get_id(ESP32_SPI_device_handle_t spi)
{
  // get_id cmd
  lcd_cmd(spi, 0x04);

  ESP32_SPI_transaction_t t;
  memset(&t, 0, sizeof(t));
  t.length=8*3;
  t.flags = SPI_TRANS_USE_RXDATA;
  t.user = (void*)1;

  esp_err_t ret = ESP32_SPI_device_polling_transmit(spi, &t);
  assert( ret == ESP_OK );

  return *(uint32_t*)t.rx_data;
}
*/



/** public function
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_TouchGUI1_Define
 *  Desc: Finalizes the creation of the requested Definition of this Module. Includes executing type
 *        specific inits.
 *  Info: Invoked by cmd-line 'Define custom_definition_name module_name'
 *  Para: Common_Definition_t* p_Common_Definition -> prefilled 'This'_Module Definition (should be casted)
 *  Rets: strTextMultiple_t* p_retMsg (error text) -> forces VETO! ; NULL = SCDE_OK
 * -------------------------------------------------------------------------------------------------
 */
strTextMultiple_t*
ESP32_TouchGUI1_Define(Common_Definition_t* p_Common_Definition)
{

  // make common ptr to modul specific ptr
  ESP32_TouchGUI1_Definition_t* p_ESP32_TouchGUI1_Definition =
		  (ESP32_TouchGUI1_Definition_t*) p_Common_Definition;

  // for Fn response msg
  strTextMultiple_t* p_retMsg = SCDE_OK;

// -------------------------------------------------------------------------------------------------

  #if ESP32_TouchGUI1_Module_DBG >= 5
  SCDEFn_at_ESP32_TouchGUI1_M->Log3Fn(p_Common_Definition->name,
	p_Common_Definition->nameLen,
	5,
	"DefineFn is called (Module '%.*s'). Creating this Definition with args '%.*s'.",
	p_ESP32_TouchGUI1_Definition->common.module->provided->typeNameLen,
	p_ESP32_TouchGUI1_Definition->common.module->provided->typeName,
	p_ESP32_TouchGUI1_Definition->common.definitionLen,
	p_ESP32_TouchGUI1_Definition->common.definition);
  #endif

// ------------------------------------------------------------------------------------------------

  // new conversation
  uint8_t *p_defArgsText = p_Common_Definition->definition;
  size_t defArgsTextLen = p_Common_Definition->definitionLen;

  // Check for args. This type requires args...
  if (!defArgsTextLen) {

	// alloc mem for retMsg
	p_retMsg = malloc(sizeof(strTextMultiple_t));

