mattehicks/SCDE/components/ESP32_TouchGUI1_Module/ESP32_TouchGUI1_Module.c
	// response with error text
	p_retMsg->strTextLen = asprintf(&p_retMsg->strText
		,"Parsing Error! Expected Args!");

	return p_retMsg;
  }

// ------------------------------------------------------------------------------------------------

//  xSemaphoreTake(p_ESP32_TouchGUI1_Definition->def_mux
//    ,portMAX_DELAY);

// ------------------------------------------------------------------------------------------------

  // store FD to Definition. Will than be processed in global loop ... -> THIS MODULE USES NO FD
  p_ESP32_TouchGUI1_Definition->common.fd = -1;

  // store table of function callbacks provided & made accessible for client modules
 // p_ESP32_TouchGUI1_Definition->ESP32_TouchGUI1_Fn = &ESP32_TouchGUI1_Fn;

// ------------------------------------------------------------------------------------------------

  // init WebIf_Provided offset
//  ESP32Control_Definition->common.link =
//	&ESP32Control_Definition->WebIf_Provided;

  // check for loaded Module 'WebIf' -> get provided Fn
  p_ESP32_TouchGUI1_Definition->WebIf_Provided.WebIf_FnProvided =
	NULL;//(WebIf_FnProvided_t *) SCDEFn_at_ESP32_TouchGUI1_M->GetFnProvidedByModule("WebIf");

 // Providing data for WebIf? Initialise data provided for WebIf
  if (p_ESP32_TouchGUI1_Definition->WebIf_Provided.WebIf_FnProvided) {

	p_ESP32_TouchGUI1_Definition->WebIf_Provided.ActiveResourcesDataA =
		(WebIf_ActiveResourcesDataA_t *) &ESP32_TouchGUI1_ActiveResourcesDataA_forWebIf;

	p_ESP32_TouchGUI1_Definition->WebIf_Provided.ActiveResourcesDataB =
		(WebIf_ActiveResourcesDataB_t *) &ESP32_TouchGUI1_ActiveResourcesDataB_forWebIf;
  }

  else	{

	SCDEFn_at_ESP32_TouchGUI1_M->Log3Fn(p_Common_Definition->name
		,p_Common_Definition->nameLen
		,1
		,"Could not enable WebIf support for '%.*s'. Type '%.*s' detects Type 'WebIf' is NOT loaded!"
		,p_ESP32_TouchGUI1_Definition->common.nameLen
		,p_ESP32_TouchGUI1_Definition->common.name
		,p_ESP32_TouchGUI1_Definition->common.module->provided->typeNameLen
		,p_ESP32_TouchGUI1_Definition->common.module->provided->typeName);
  }

// ------------------------------------------------------------------------------------------------

  // Parse define-args (KEY=VALUE) protocol -> gets parsedKVInput in allocated mem, NULL = ERROR
  parsedKVInputArgs_t* p_parsedKVInput = 
	SCDEFn_at_ESP32_TouchGUI1_M->ParseKVInputArgsFn(ESP32_TouchGUI1_SET_NUMBER_OF_IK		// Num Implementated KEYs MAX
	,ESP32_TouchGUI1_Set_ImplementedKeys					// Implementated Keys
	,p_defArgsText								// our args text
	,defArgsTextLen);							// our args text len

  // parsing may report an problem. args contain: unknown keys, double keys, ...?
  if (!p_parsedKVInput) {

	// alloc mem for retMsg
	p_retMsg = malloc(sizeof(strTextMultiple_t));

	// response with error text
	p_retMsg->strTextLen = asprintf(&p_retMsg->strText
		,"Parsing Error! Args '%.*s' not taken! Check the KEYs!"
		,defArgsTextLen
		,p_defArgsText);

	if (p_parsedKVInput) {

		free(p_parsedKVInput);
	}

	return p_retMsg;
  }

// ------------------------------------------------------------------------------------------------

  // try 1 - arguments for configuration as i2c master ?

  // set required Keys -> Keys that should be there in this request
  p_parsedKVInput->requiredKVBF = 	( (1 << ESP32_TouchGUI1_SET_I2C_NUM)
					| (1 << ESP32_TouchGUI1_SET_I2C_MODE)
					| (1 << ESP32_TouchGUI1_SET_SDA_IO)
					| (1 << ESP32_TouchGUI1_SET_SDA_IO_PULLUP)
					| (1 << ESP32_TouchGUI1_SET_SCL_IO)
					| (1 << ESP32_TouchGUI1_SET_SCL_IO_PULLUP)
					| (1 << ESP32_TouchGUI1_SET_MASTER_CLOCK)
					);

  // set forbidden Keys -> Keys that are not allowed in this request
  p_parsedKVInput->forbiddenKVBF = 	( (1 << ESP32_TouchGUI1_SET_SLAVE_10BIT_ENA)
					| (1 << ESP32_TouchGUI1_SET_SLAVE_ADRESS)
 					);
/*
  // process the set-args (key=value@) protocol
  if (ESP32_TouchGUI1_ProcessKVInputArgs(ESP32_TouchGUI1_Definition
	,p_parsedKVInput				// KVInput parsed
	,p_defArgsText				// our args text
	,defArgsTextLen) ) {			// our args text len

	// Processing reports an problem. Args not taken. Response with error text.

	// alloc mem for retMsg
	p_retMsg = malloc(sizeof(strTextMultiple_t));

	// response with error text
	p_retMsg->strTextLen = asprintf(&p_retMsg->strText
		,"Processing Error! Args '%.*s' not taken! Check the VALUEs!"
		,defArgsTextLen
		,p_defArgsText);

	// free allocated memory for query result key-field
	free(p_parsedKVInput);

	return p_retMsg;

  }
*/
// ------------------------------------------------------------------------------------------------

  // set affected readings
 // ESP32_TouchGUI1_SetAffectedReadings(p_ESP32_TouchGUI1_Definition
//	,p_parsedKVInput->affectedReadingsBF);

// ------------------------------------------------------------------------------------------------

  // free allocated memory for query result key-field
  free(p_parsedKVInput);

// ------------------------------------------------------------------------------------------------

//play here
/*
#define REFERENCE_PRESSUREx 103800l
  // replace by key=value init
  BMP180_Definition->oversampling = BMP180_ULTRA_HIGH_RES;
  BMP180_Definition->reference_pressure = REFERENCE_PRESSUREx;
  // + poll intervall*/

  // temp build 'ESP32_TouchGUI1'
  p_ESP32_TouchGUI1_Definition->stage1definitionNameLen = 
		asprintf( (char**) &p_ESP32_TouchGUI1_Definition->stage1definitionName,"SPI");

// ------------------------------------------------------------------------------------------------

  // get pointer to 1st stage modul (we developing for...)
  ESP32_SPI_Definition_t* p_ESP32_SPI_Definition =
		(ESP32_SPI_Definition_t*) SCDEFn_at_ESP32_TouchGUI1_M->GetDefinitionPtrByNameFn(
		p_ESP32_TouchGUI1_Definition->stage1definitionNameLen,
		p_ESP32_TouchGUI1_Definition->stage1definitionName);

  // not found - retMsg & define-veto
  if (!p_ESP32_SPI_Definition) {

	// alloc mem for retMsg
	p_retMsg = malloc(sizeof(strTextMultiple_t));

