mattehicks/SCDE/components/ESP32_TouchGUI1_Module/ESP32_TouchGUI1_Module.c
	// response with error text
	p_retMsg->strTextLen = asprintf(&p_retMsg->strText
		,"Stage 1 Module '%.*s' not found! Stopping define!"
		,p_ESP32_TouchGUI1_Definition->stage1definitionNameLen
		,p_ESP32_TouchGUI1_Definition->stage1definitionName);

	return p_retMsg;
  }

// ------------------------------------------------------------------------------------------------

  #if ESP32_TouchGUI1_Module_DBG >= 7
  SCDEFn_at_ESP32_TouchGUI1_M->Log3Fn(p_Common_Definition->name
	,p_Common_Definition->nameLen
	,7
	,"Found an first Stage defined as name '%.*s'. Its Type '%.*s' !"
	,p_ESP32_SPI_Definition->common.nameLen
	,p_ESP32_SPI_Definition->common.name
	,p_ESP32_SPI_Definition->common.module->provided->typeNameLen
	,p_ESP32_SPI_Definition->common.module->provided->typeName);
  #endif

// ------------------------------------------------------------------------------------------------

  // store link to stage 1
  p_ESP32_TouchGUI1_Definition->p_ESP32_SPI_Definition = 
	p_ESP32_SPI_Definition;

  // get table of function callbacks provided & made accessible from stage 1 Module
  ESP32_SPI_ProvidedByModule_t* p_ESP32_SPI_provided_fn = (ESP32_SPI_ProvidedByModule_t*)
	p_ESP32_TouchGUI1_Definition->p_ESP32_SPI_Definition->common.module->provided;

// ------------------------------------------------------------------------------------------------




// Play here...

/* we need:
REQ:
Blocka: (spi<-> display)
clock_speed
mode ?
PIN_NUM_CS


BlockB: (display)
TFT_DISP_TYPE
DISPLAY_WIDTH
DISPLAY_HEIGHT



opt:
Blocka: (spi<-> display)


BlockB: (display)
GREY_SCALE
*/












// ------------------------------------------------------------------------------------------------

  // alloc mem for the TFT Globals (TFTGlobals_t)
  TFTGlobals_t* p_TFT_globals =
	malloc(sizeof(TFTGlobals_t));

  // check if we got memory? Else load retMsg an goto NOMEMORY
  SCDE_CHECK_LOAD_ERROR_TEXT_GOTO(p_TFT_globals,
		"Could not allocate TFTGlobals_t", error_cleanup_1;);

  // store the display configuration
  p_ESP32_TouchGUI1_Definition->p_TFT_globals = p_TFT_globals;

  // zero / start clean TFTGlobals_t
  memset(p_TFT_globals, 0, sizeof(TFTGlobals_t));

  // initial fill ...
printf("maik1%p",p_TFT_globals);

 // p_TFT_globals = &(TFTGlobals_t) {
 	p_TFT_globals->orientation = LANDSCAPE;	// screen orientation
	p_TFT_globals->font_rotate = 0;		// font rotation
	p_TFT_globals->font_transparent = 0;
	p_TFT_globals->font_forceFixed = 0;
	p_TFT_globals->text_wrap = 0;			// character wrapping to new line
//	p_TFT_globals->_fg = {  .r = 0, .g = 255,  .b =  0};		// forderground color
	p_TFT_globals->_fg.r = 0;
	p_TFT_globals->_fg.g = 255;
	p_TFT_globals->_fg.b = 0;

//	p_TFT_globals->_bg = {  0,   0,   0};		// backgroung color
	p_TFT_globals->_bg.r = 0;
	p_TFT_globals->_bg.g = 0;
	p_TFT_globals->_bg.b = 0;

	p_TFT_globals->image_debug = 0;	// for debug output in image extraction 
	p_TFT_globals->_angleOffset = DEFAULT_ANGLE_OFFSET; 	// ?
	p_TFT_globals->TFT_X = 0;
	p_TFT_globals->TFT_Y = 0;
	p_TFT_globals->tp_calx = 7472920;
	p_TFT_globals->tp_caly = 122224794;

	/*p_TFT_globals->dispWin = {			// all drawings are clipped to 'dispWin'
		.x1 = 0,
		.y1 = 0,
		.x2 = DEFAULT_TFT_DISPLAY_WIDTH,
		.y2 = DEFAULT_TFT_DISPLAY_HEIGHT
	};*/
	p_TFT_globals->dispWin.x1 = 0;
	p_TFT_globals->dispWin.y1 = 0;
	p_TFT_globals->dispWin.x2 = DEFAULT_TFT_DISPLAY_WIDTH;
	p_TFT_globals->dispWin.y2 = DEFAULT_TFT_DISPLAY_HEIGHT;

	p_TFT_globals->font_buffered_char = 1;
	p_TFT_globals->font_line_space = 0;

	// display dimension of hardware screen
	p_TFT_globals->_width = DEFAULT_TFT_DISPLAY_WIDTH;
	p_TFT_globals->_height = DEFAULT_TFT_DISPLAY_HEIGHT;

	// Converts colors to grayscale if set to 1
	p_TFT_globals->gray_scale = 0;

	// stores the selected userfont
	p_TFT_globals->userfont = NULL;
	p_TFT_globals->TFT_OFFSET = 0;
	p_TFT_globals->_arcAngleMax = DEFAULT_ARC_ANGLE_MAX;
//};
printf("maik2%p",p_TFT_globals);
// ------------------------------------------------------------------------------------------------

  // alloc mem for the SPI device interface config (ESP32_SPI_device_interface_config_t)
  ESP32_SPI_device_interface_config_t* p_disp_interface_config =
	malloc(sizeof(ESP32_SPI_device_interface_config_t));

  // check if we got memory? Else load retMsg an goto NOMEMORY
  SCDE_CHECK_LOAD_ERROR_TEXT_GOTO(p_disp_interface_config,
		"Could not allocate ESP32_SPI_device_interface_config_t", error_cleanup_2);

  // store the display configuration
  p_ESP32_TouchGUI1_Definition->p_disp_interface_config = p_disp_interface_config;

  // zero / start clean ESP32_SPI_device_interface_config_t
  memset(p_disp_interface_config, 0, sizeof(ESP32_SPI_device_interface_config_t));

  // initial fill ...

  p_disp_interface_config = &(ESP32_SPI_device_interface_config_t) {
//      .clock_speed_hz = 26*1000*1000,        		// Clock out at 26 MHz (overclock)
	.clock_speed_hz = 10*1000*1000,        		// Clock out at 10 MHz
	.mode = 0,                            	 	// SPI mode 0
	.spics_io_num = PIN_NUM_CS,             	// CS pin
	.queue_size = 7,                       		// We want to be able to queue 7 transactions at a time
	.pre_cb = lcd_spi_pre_transfer_callback,	//Specify pre-transfer callback to handle D/C line
//	.post_cb = lcd_spi_post_transfer_callback,
};

// ------------------------------------------------------------------------------------------------


  printf("pre:%p.\r\n", p_disp_interface_config->pre_cb);
  printf("post:%p.\r\n", p_disp_interface_config->post_cb);

// ------------------------------------------------------------------------------------------------

  // set display type
  p_ESP32_TouchGUI1_Definition->display_config.tft_disp_type = DEFAULT_DISP_TYPE;
	//tft_disp_type = DISP_TYPE_ILI9341;
	//tft_disp_type = DISP_TYPE_ILI9488;
	//tft_disp_type = DISP_TYPE_ST7735B;

  // Attach this Definitions display (SPI device) to given Definition (ESP32_SPI_Module!) SPI bus host
  p_retMsg = p_ESP32_SPI_provided_fn->ESP32_SPI_bus_add_deviceFn(p_ESP32_SPI_Definition,
	p_disp_interface_config,				// spi interface cfg. for display
	&p_ESP32_TouchGUI1_Definition->p_disp_handle);		// the handle will be stored here

  // error occured ? We have message -> deinit
  if (p_retMsg) goto error_cleanup_3;


