mattehicks/SCDE/components/ESP32_TouchGUI1_Module/ESP32_TouchGUI1_Module.c
  printf("GUI: display device connected to spi Module, we have handle (host %d) at %p\r\n",
	p_ESP32_SPI_Definition->p_host->host_device,
	p_ESP32_TouchGUI1_Definition->p_disp_handle);



// ------------------------------------------------------------------------------------------------

  // Init this Definitions display (SPI device). It is connected now.
  p_retMsg = TFT_display_init(p_ESP32_TouchGUI1_Definition->p_disp_handle,
	p_ESP32_TouchGUI1_Definition->p_TFT_globals,
	&p_ESP32_TouchGUI1_Definition->display_config);

  // error occured ? We have message -> deinit
  if (p_retMsg) goto error_cleanup_4;

   printf("SPI: display init done.\r\n");

// ------------------------------------------------------------------------------------------------

  // do the initial stuff ...
  ESP32_SPI_device_handle_t p_disp_handle = p_ESP32_TouchGUI1_Definition->p_disp_handle;

  TFT_setGammaCurve(p_disp_handle, DEFAULT_GAMMA_CURVE);

  TFT_setRotation(p_disp_handle, p_TFT_globals, PORTRAIT);

  TFT_setFont(p_TFT_globals, DEFAULT_FONT, NULL);

  TFT_resetclipwin(p_TFT_globals);

  TFT_print(p_disp_handle, p_TFT_globals, "Time is not set yet", CENTER, CENTER);

// ------------------------------------------------------------------------------------------------













/*

// ==========================================================
// Define which spi bus to use TFT_VSPI_HOST or TFT_HSPI_HOST
#define SPI_BUS HSPI_HOST
// ==========================================================


    // ========  PREPARE DISPLAY INITIALIZATION  =========

    esp_err_t ret;

    // === SET GLOBAL VARIABLES ==========================



  // Init Spi device handles for display and touch screen
  ESP32_TouchGUI1_Definition->disp_handle = NULL;
  ESP32_TouchGUI1_Definition->ts_spi = NULL;




    // ===================================================

    // ==== Set display type                         =====
    ESP32_TouchGUI1_Definition->tft_disp_type = DEFAULT_DISP_TYPE;
	//tft_disp_type = DISP_TYPE_ILI9341;
	//tft_disp_type = DISP_TYPE_ILI9488;
	//tft_disp_type = DISP_TYPE_ST7735B;
    // ===================================================

	// ===================================================
	// === Set display resolution if NOT using default ===
	// === DEFAULT_TFT_DISPLAY_WIDTH &                 ===
    // === DEFAULT_TFT_DISPLAY_HEIGHT                  ===
	ESP32_TouchGUI1_Definition->_width = DEFAULT_TFT_DISPLAY_WIDTH;  // smaller dimension
	ESP32_TouchGUI1_Definition->_height = DEFAULT_TFT_DISPLAY_HEIGHT; // larger dimension
	//_width = 128;  // smaller dimension
	//_height = 160; // larger dimension
	// ===================================================

	// Converts colors to grayscale if set to 1
	ESP32_TouchGUI1_Definition->gray_scale = 0;

	// ===================================================
	// ==== Set maximum spi clock for display read    ====
	//      operations, function 'find_rd_speed()'    ====
	//      can be used after display initialization  ====
	max_rdclock = 8000000;
	// ===================================================

    // ====================================================================
    // === Pins MUST be initialized before SPI interface initialization ===
    // ====================================================================
    TFT_PinsInit(ESP32_TouchGUI1_Definition);

    // ====  CONFIGURE SPI DEVICES(s)  ====================================================================================

    ESP32_SPI_Module_spi_device_handle_t disp_handle;
	
    ESP32_SPI_bus_config_t buscfg = {
        .miso_io_num = PIN_NUM_MISO,				// set SPI MISO pin
        .mosi_io_num = PIN_NUM_MOSI,				// set SPI MOSI pin
        .sclk_io_num = PIN_NUM_CLK,				// set SPI CLK pin
        .quadwp_io_num = -1,
        .quadhd_io_num = -1,
	.max_transfer_sz = 6 * 1024,
    };

    ESP32_SPI_Module_spi_device_interface_config_t devcfg = {
        .clock_speed_hz = 8000000,              // Initial clock out at 8 MHz
        .mode = 0,                              // SPI mode 0
        .spics_io_num = -1,                     // we will use external CS pin
	.spics_ext_io_num = PIN_NUM_CS,         // external CS pin
	.flags = LB_SPI_DEVICE_HALFDUPLEX,	// ALWAYS SET to HALF DUPLEX MODE!! for display spi
    };


  vTaskDelay(500 / portTICK_RATE_MS);

  printf("\r\n==============================\r\n");
  printf("TFT display DEMO, LoBo 11/2017\r\n");
  printf("==============================\r\n");
  printf("Pins used: miso=%d, mosi=%d, sck=%d, cs=%d, d/c=%d, Tcs=%d\r\n",
	PIN_NUM_MISO,
	PIN_NUM_MOSI,
	PIN_NUM_CLK,
	PIN_NUM_CS,
	PIN_NUM_DC,
	PIN_NUM_TCS);

#if USE_TOUCH > TOUCH_TYPE_NONE
    printf(" Touch CS: %d\r\n", PIN_NUM_TCS);
#endif

	printf("==============================\r\n\r\n");

	// ==================================================================
	// ==== Initialize the SPI bus and attach the LCD to the SPI bus ====


  ret = ESP32_SPI_provided_fn->ESP32_SPI_bus_add_deviceFn(ESP32_TouchGUI1_Definition->ESP32_SPI_Definition, SPI_BUS,
	//&buscfg,
	&devcfg,
	&disp_handle);

  assert(ret==ESP_OK);

  printf("SPI: display device added to spi bus (%d)\r\n", SPI_BUS);

  // save display spi handle
  ESP32_TouchGUI1_Definition->disp_handle = disp_spi;

  // ==== Test select/deselect ====
  ret = ESP32_SPI_provided_fn->ESP32_SPI_device_acquire_busFn(ESP32_TouchGUI1_Definition->ESP32_SPI_Definition, disp_spi, 1);

  assert(ret==ESP_OK);

  printf("Err?1 (%d)\r\n", ret);

  ret = ESP32_SPI_provided_fn->ESP32_SPI_device_release_busFn(disp_spi);

  assert(ret==ESP_OK);

  printf("Err?2 (%d)\r\n", ret);


  printf("SPI: attached display device, speed=%u\r\n",
	 ESP32_SPI_provided_fn->ESP32_SPI_spi_get_speedFn(ESP32_TouchGUI1_Definition->ESP32_SPI_Definition, disp_spi));
  printf("SPI: bus uses native pins: %s\r\n", 
	ESP32_SPI_provided_fn->ESP32_SPI_spi_uses_native_pinsFn(disp_spi) ? "true" : "false");



