mattehicks/SCDE/components/ESP32_TouchGUI1_Module/ESP32_TouchGUI1_Module.c
	// ================================
	// ==== Initialize the Display ====

	printf("SPI: display init...\r\n");
	TFT_display_init(ESP32_TouchGUI1_Definition);
    printf("OK\r\n");



	// ---- Detect maximum read speed ----
	max_rdclock = find_rd_speed(ESP32_TouchGUI1_Definition);
	printf("SPI: Max rd speed = %u\r\n", max_rdclock);

    // ==== Set SPI clock used for display operations ====
	ESP32_SPI_provided_fn->ESP32_SPI_spi_set_speedFn(ESP32_TouchGUI1_Definition->ESP32_SPI_Definition, disp_spi, DEFAULT_SPI_CLOCK);
	printf("SPI: Changed speed to %u\r\n", 
		ESP32_SPI_provided_fn->ESP32_SPI_spi_get_speedFn(ESP32_TouchGUI1_Definition->ESP32_SPI_Definition, disp_spi));

    printf("\r\n---------------------\r\n");
	printf("Graphics demo started\r\n");
	printf("---------------------\r\n");




	font_rotate = 0;
	text_wrap = 0;
	font_transparent = 0;
	font_forceFixed = 0;
	ESP32_TouchGUI1_Definition->gray_scale = 0;

  TFT_setGammaCurve(disp_spi, DEFAULT_GAMMA_CURVE);

  TFT_setRotation(ESP32_TouchGUI1_Definition, PORTRAIT);

  TFT_setFont(DEFAULT_FONT, NULL);

  TFT_resetclipwin(ESP32_TouchGUI1_Definition);

  TFT_print(ESP32_TouchGUI1_Definition, "Time is not set yet", CENTER, CENTER);




*/































/*
// ------------------------------------------------------------------------------------------------

  // set required Keys -> Keys that should be there in this request
  parsedKVInput->requiredKVBF = ( (1 << ESP32_TouchGUI1_SET_I2C_NUM)
			        | (1 << ESP32_TouchGUI1_SET_I2C_MODE)
			        | (1 << ESP32_TouchGUI1_SET_SDA_IO)
			        | (1 << ESP32_TouchGUI1_SET_SDA_IO_PULLUP)
			        | (1 << ESP32_TouchGUI1_SET_SCL_IO)
			        | (1 << ESP32_TouchGUI1_SET_SCL_IO_PULLUP) );

  // set forbidden Keys -> Keys that are not allowed in this request
  parsedKVInput->forbiddenKVBF = 0;

  // process the set-args (key=value@) protocol
  if (ESP32_TouchGUI1_ProcessKVInputArgs(ESP32_TouchGUI1_Definition
    ,parsedKVInput				// KVInput parsed
    ,defArgsText				// our args text
    ,defArgsTextLen) ) {			// our args text len

    // Processing reports an problem. Args not taken. Response with error text.

    // alloc mem for retMsg
    retMsg = malloc(sizeof(strTextMultiple_t));

    // response with error text
    retMsg->strTextLen = asprintf(&retMsg->strText
      ,"Processing Error! Args '%.*s' not taken! Check the VALUEs!"
      ,defArgsTextLen
      ,defArgsText);

    // free allocated memory for query result key-field
    free(parsedKVInput);

    return retMsg;
  }

// ------------------------------------------------------------------------------------------------
*/
  // set affected readings
 // ESP32_TouchGUI1_SetAffectedReadings(ESP32_TouchGUI1_Definition
  //  ,parsedKVInput->affectedReadingsBF);

// ------------------------------------------------------------------------------------------------

  // free allocated memory for query result key-field
  //free(parsedKVInput);


// ------------------------------------------------------------------------------------------------

  // set up 1st idle Callback
  p_ESP32_TouchGUI1_Definition->common.Common_CtrlRegA |= F_WANTS_IDLE_TASK;

  return p_retMsg;

// XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
// alternative end in case of errors - free all allocated things and return with retMsg as veto.

error_cleanup_4:

 // ??? -> retMsg + retMsg AddFn fehlt !!!!!!!!!!!?
 // Free this Definitions display (SPI device) from SPI bus host
  p_ESP32_SPI_provided_fn->ESP32_SPI_bus_remove_deviceFn(p_ESP32_TouchGUI1_Definition->p_disp_handle);

error_cleanup_3:

  // the ESP32_SPI_device_interface_config_t is allocated here
  free(p_ESP32_TouchGUI1_Definition->p_disp_interface_config);

error_cleanup_2:

  // the TFTGlobals_t is allocated here
  free(p_ESP32_TouchGUI1_Definition->p_TFT_globals);

error_cleanup_1:
/*
  if (p_parsedKVInput) {

    free(p_parsedKVInput);

  }

*/
  return p_retMsg;
}



/**
 * --------------------------------------------------------------------------------------------------
 *  FName: ESP32_TouchGUI1_DirectWrite
 *  Desc: for 2 stage designs - called to give write job to 1st stage (this stage)
 *  Info: 
 *  Para: ESP32_TouchGUI1_Definition_t *ESP32_TouchGUI1_Definition -> WebIF Definition that should be removed
 *  Rets: strTextMultiple_t* -> response text NULL=no text
 * --------------------------------------------------------------------------------------------------
 */
/*
strTextMultiple_t *
ESP32_TouchGUI1_DirectWrite(
	 Common_Definition_t *Common_Definition_Stage1
	,Common_Definition_t *Common_Definition_Stage2
	,Common_StageXCHG_t *Common_StageXCHG)
{
  // for Fn response msg
  strTextMultiple_t *retMsg = NULL;
  // to adress 1st stage definition - make common ptr to modul specific ptr
  ESP32_TouchGUI1_Definition_t *ESP32_TouchGUI1_Definition_Stage1 =
	(ESP32_TouchGUI1_Definition_t*) Common_Definition_Stage1;
  // make common ptr to modul specific ptr
  ESP32_TouchGUI1_StageXCHG_t *ESP32_TouchGUI1_StageXCHG =
	(ESP32_TouchGUI1_StageXCHG_t*) Common_StageXCHG;
// -------------------------------------------------------------------------------------------------
// check 4 matching modules
// -------------------------------------------------------------------------------------------------
// -------------------------------------------------------------------------------------------------
  #if ESP32_TouchGUI1_Module_DBG >= 5
  SCDEFn_at_ESP32_TouchGUI1_M->Log3Fn(
	 ESP32_TouchGUI1_Definition_Stage1->common.name
	,ESP32_TouchGUI1_Definition_Stage1->common.nameLen
	,5
	,"DirectWriteFn of Definition '%.*s' (Module '%.*s') is called "
  	 "from Definition '%.*s' (Module '%.*s') to exec write job."
	,ESP32_TouchGUI1_Definition_Stage1->common.nameLen
	,ESP32_TouchGUI1_Definition_Stage1->common.name
	,ESP32_TouchGUI1_Definition_Stage1->common.module->provided->typeNameLen
	,ESP32_TouchGUI1_Definition_Stage1->common.module->provided->typeName
	,Common_Definition_Stage2->nameLen
	,Common_Definition_Stage2->name
	,Common_Definition_Stage2->module->provided->typeNameLen
	,Common_Definition_Stage2->module->provided->typeName);
  #endif
// -------------------------------------------------------------------------------------------------
  return retMsg;
}
*/





void
Redraw_Time(ESP32_TouchGUI1_Definition_t* p_ESP32_TouchGUI1_Definition)
{
  time_t time_now;

  struct tm* tm_info;

  char tmp_buff[64];

  // redraw time
  time(&time_now);

