mattehicks/SCDE/components/ESP32_TouchGUI1_Module/ESP32_TouchGUI1_Module.c
  if (time_now > p_ESP32_TouchGUI1_Definition->time_last) {

	// to backup fg+bg
	color_t last_fg, last_bg;

	// save updated time
	p_ESP32_TouchGUI1_Definition->time_last = time_now;

	// prepare time
	tm_info = localtime(&time_now);

	// make time text
	sprintf(tmp_buff, "%02d:%02d:%02d",
		tm_info->tm_hour,
		tm_info->tm_min,
		tm_info->tm_sec);

	// create p_disp_handle to work with display ..
	ESP32_SPI_device_handle_t p_disp_handle = p_ESP32_TouchGUI1_Definition->p_disp_handle;

	// create p_TFT_globals to work with screen
	TFTGlobals_t* p_TFT_globals = p_ESP32_TouchGUI1_Definition->p_TFT_globals;

	TFT_saveClipWin(p_TFT_globals);
	TFT_resetclipwin(p_TFT_globals);

	Font curr_font = cfont;

	last_bg = p_TFT_globals->_bg;
	last_fg = p_TFT_globals->_fg;

	p_TFT_globals->_fg = TFT_YELLOW;

	p_TFT_globals->_bg = (color_t){ 64, 64, 64 };

	TFT_setFont(p_TFT_globals, DEFAULT_FONT, NULL);

	TFT_fillRect(p_disp_handle,
		p_TFT_globals,
		1,
		p_TFT_globals->_height - TFT_getfontheight() - 8,
		p_TFT_globals->_width - 3,
		TFT_getfontheight() + 6,
		p_TFT_globals->_bg);

	TFT_print(p_disp_handle,
		p_TFT_globals,
		tmp_buff,
		RIGHT,//CENTER,
		p_TFT_globals->_height - TFT_getfontheight()-5);

	cfont = curr_font;
	p_TFT_globals->_fg = last_fg;
	p_TFT_globals->_bg = last_bg;

	TFT_restoreClipWin(p_TFT_globals);
  }

  return;
}











/*
 * ------------------------------------------------------------------------------------------------
 *  FName: ESP32_TouchGUI1_IdleCb	
 *  Desc: Timed callback, X Hz, to do type dependend processing tasks.
 *  Info: 
 *  Para: Common_Definition_t *Common_Definition -> prefilled WebIf Definition 
 *  Rets: ? unclear char* -> response text NULL=no text
 * ------------------------------------------------------------------------------------------------
 */
int //feedModuleTask
ESP32_TouchGUI1_IdleCb(Common_Definition_t *p_Common_Definition)
{
  // make common ptr to modul specific ptr
  ESP32_TouchGUI1_Definition_t* p_ESP32_TouchGUI1_Definition =
		  (ESP32_TouchGUI1_Definition_t*) p_Common_Definition;

  // for Fn response msg
 // strTextMultiple_t* p_retMsg = SCDE_OK;

// -------------------------------------------------------------------------------------------------

  #if ESP32_TouchGUI1_Module_DBG >= 9
  SCDEFn_at_ESP32_TouchGUI1_M->Log3Fn(p_Common_Definition->name,
	p_Common_Definition->nameLen,
	9,
	"IdleCbFn is called (Module '%.*s').",
	p_ESP32_TouchGUI1_Definition->common.module->provided->typeNameLen,
	p_ESP32_TouchGUI1_Definition->common.module->provided->typeName);
  #endif

// ------------------------------------------------------------------------------------------------

  // redraw the time at bottom, if changed
 // Redraw_Time(p_ESP32_TouchGUI1_Definition);


  // set up next idle Callback
  p_ESP32_TouchGUI1_Definition->common.Common_CtrlRegA |= F_WANTS_IDLE_TASK;

  return 0;
}















/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_TouchGUI1_Initialize
 *  Desc: Initializion of SCDE Function Callbacks of an new loaded module
 *  Info: Stores Module-Information (Function Callbacks) to SCDE-Root
 *  Para: SCDERoot_t* SCDERootptr -> ptr to SCDE Data Root
 *  Rets: ? unused
 *--------------------------------------------------------------------------------------------------
 */
int 
ESP32_TouchGUI1_Initialize(SCDERoot_t* SCDERootptr)
{

  // make data root locally available
  SCDERoot_at_ESP32_TouchGUI1_M = SCDERootptr;

  // make locally available from data-root: SCDEFn (Functions / callbacks) for faster operation
  SCDEFn_at_ESP32_TouchGUI1_M = SCDERootptr->SCDEFn;

  SCDEFn_at_ESP32_TouchGUI1_M->Log3Fn(ESP32_TouchGUI1_ProvidedByModule.common.typeName
		  ,ESP32_TouchGUI1_ProvidedByModule.common.typeNameLen
		  ,3
		  ,"InitializeFn called. Type '%.*s' now useable.\n"
		  ,ESP32_TouchGUI1_ProvidedByModule.common.typeNameLen
		  ,ESP32_TouchGUI1_ProvidedByModule.common.typeName);

  return 0;
}



/**
 * -------------------------------------------------------------------------------------------------
 *  FName: ESP32_TouchGUI1_Set
 *  Desc: Processes the device-specific command line arguments from the set command
 *  Info: Invoked by cmd-line 'Set ESP32Control_Definition.common.Name setArgs'
 *  Para: ESP32Control_Definition_t *ESP32Control_Definition -> WebIF Definition that should get a set cmd
 *        uint8_t *setArgsText -> the setArgsText
 *        size_t setArgsTextLen -> length of the setArgsText
 *  Rets: strTextMultiple_t* -> response text in allocated memory, NULL=no text
 * -------------------------------------------------------------------------------------------------
 */
strTextMultiple_t *
ESP32_TouchGUI1_Set(Common_Definition_t* Common_Definition
	,uint8_t *setArgsText
	,size_t setArgsTextLen)
{

  // for Fn response msg
  strTextMultiple_t *retMsg = NULL;

  // make common ptr to modul specific ptr
  ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition =
	(ESP32_TouchGUI1_Definition_t*) Common_Definition;

  #if ESP32_TouchGUI1_Module_DBG >= 5
  printf("\n|ESP32_TouchGUI1_Set, Name:%.*s, got args:%.*s>"
	,ESP32_TouchGUI1_Definition->common.nameLen
	,ESP32_TouchGUI1_Definition->common.name
	,setArgsTextLen
	,setArgsText);
  #endif

// ------------------------------------------------------------------------------------------------

  // note: _Set Fn call not allowed with setArgsTextLen = 0 (CHECK!)

  // setArgsText '?' -> respond with help
  if ( (setArgsTextLen > 0) && (*setArgsText == '?') ) {

	// set start of possible Type-Name
	const uint8_t *tempTxt = setArgsText + 1;

	// a seek-counter
	int i = 1;

	// skip spaces after '?' (search for more ...)
	while( (i < setArgsTextLen) && (*tempTxt == ' ') ) {i++;tempTxt++;}

	// only spaces after '?' -> answer with Set-Capabilities
	if (i == setArgsTextLen) {

