mattehicks/SCDE/components/ESP32_TouchGUI1_Module/ESP32_TouchGUI1_Module.c
		// response with error text
		// alloc mem for retMsg
		retMsg = malloc(sizeof(strTextMultiple_t));

		// response with error text
		retMsg->strTextLen = asprintf(&retMsg->strText
			,"requested ? '%.*s' !"
			,setArgsTextLen
			,setArgsText);

		return retMsg;

		}
	// '? + X' here !!! -> normal parse
	}

// ------------------------------------------------------------------------------------------------

  // Parse set-args (KEY=VALUE) protocol -> gets parsedKVInput in allocated mem, NULL = ERROR
  parsedKVInputArgs_t *parsedKVInput = 
	SCDEFn_at_ESP32_TouchGUI1_M->ParseKVInputArgsFn(ESP32_TouchGUI1_SET_NUMBER_OF_IK	// Num Implementated KEYs MAX for Set Fn
	,ESP32_TouchGUI1_Set_ImplementedKeys		// Implementated Keys for Set Fn
	,setArgsText				// our args text
	,setArgsTextLen);			// our args text len

  // parsing may report an problem. args contain: unknown keys, double keys, ...?
  if (!parsedKVInput) {

	// alloc mem for retMsg
	retMsg = malloc(sizeof(strTextMultiple_t));

	// response with error text
	retMsg->strTextLen = asprintf(&retMsg->strText
		,"Parsing Error! Args '%.*s' not taken! Check the KEYs!"
		,setArgsTextLen
		,setArgsText);

	return retMsg;
  }

// ------------------------------------------------------------------------------------------------

  // set required Keys -> Keys that should be there in this request
  parsedKVInput->requiredKVBF = 0;

  // set forbidden Keys -> Keys that are not allowed in this request
//  parsedKVInput->forbiddenKVBF = ( (1 << ESP32_TouchGUI1_SET_CNT_UNIT) );
  parsedKVInput->forbiddenKVBF = 0;

  // process the set-args (key=value@) protocol
  if (ESP32_TouchGUI1_ProcessKVInputArgs(ESP32_TouchGUI1_Definition
	,parsedKVInput				// KVInput parsed
	,setArgsText				// our args text
	,setArgsTextLen) ) {			// our args text len

 	// Processing reports an problem. Args not taken. Response with error text.

	// alloc mem for retMsg
	retMsg = malloc(sizeof(strTextMultiple_t));

	// response with error text
	retMsg->strTextLen = asprintf(&retMsg->strText
		,"Processing Error! Args '%.*s' not taken! Check the VALUEs!"
		,setArgsTextLen
		,setArgsText);

	// free allocated memory for query result key-field
	free(parsedKVInput);

	return retMsg;
  }

// ------------------------------------------------------------------------------------------------

  // set affected readings
  ESP32_TouchGUI1_SetAffectedReadings(ESP32_TouchGUI1_Definition
	,parsedKVInput->affectedReadingsBF);

// ---------------------

  // free allocated memory for query result key-field
  free(parsedKVInput);

  return retMsg;

}



/**
 * --------------------------------------------------------------------------------------------------
 *  FName: ESP32_TouchGUI1_Shutdown
 *  Desc: called after 
 *  Info: Invoked by cmd-line 'Undefine ESP32_TouchGUI1_Definition.common.Name'
 *  Para: ESP32_TouchGUI1_Definition_t *ESP32_TouchGUI1_Definition -> WebIF Definition that should be removed
 *  Rets: strTextMultiple_t* -> response text NULL=no text
 * --------------------------------------------------------------------------------------------------
 */
strTextMultiple_t* ICACHE_FLASH_ATTR
ESP32_TouchGUI1_Shutdown(Common_Definition_t *Common_Definition)
{

  // for Fn response msg
  strTextMultiple_t *retMsg = NULL;

  // make common ptr to modul specific ptr
  ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition =
	(ESP32_TouchGUI1_Definition_t*) Common_Definition;

// -------------------------------------------------------------------------------------------------

  #if ESP32_TouchGUI1_Module_DBG >= 5
  printf("\n|ESP32_TouchGUI1_Shutdown, Name:%.*s>"
	,ESP32_TouchGUI1_Definition->common.nameLen
	,ESP32_TouchGUI1_Definition->common.name);
  #endif

// -------------------------------------------------------------------------------------------------

  return retMsg;

}



/** public function
 * --------------------------------------------------------------------------------------------------
 *  FName: ESP32_TouchGUI1_Undefine
 *  Desc: Removes the requested Definition of this Module. Includes executing type specific cleanup.
 *  Info: Invoked by cmd-line 'Undefine custom_definition_name'
 *  Para: Common_Definition_t* p_Common_Definition -> An Definition of this Module to remove (should be casted)
 *  Rets: strTextMultiple_t* -> p_retMsg (error text) -> forces VETO! ; NULL=SCDE_OK
 * --------------------------------------------------------------------------------------------------
 */
strTextMultiple_t* ICACHE_FLASH_ATTR
ESP32_TouchGUI1_Undefine(Common_Definition_t* p_Common_Definition)
{
  // make common ptr to modul specific ptr
  ESP32_TouchGUI1_Definition_t* p_ESP32_TouchGUI1_Definition =
		  (ESP32_TouchGUI1_Definition_t*) p_Common_Definition;

  // for Fn response msg
  strTextMultiple_t* p_retMsg = SCDE_OK;

// -------------------------------------------------------------------------------------------------

  #if ESP32_TouchGUI1_Module_DBG >= 5
  SCDEFn_at_ESP32_TouchGUI1_M->Log3Fn(p_Common_Definition->name,
	p_Common_Definition->nameLen,
	5,
	"UndefineFn is called (Module '%.*s'). Deleting this Definition.",
	p_ESP32_TouchGUI1_Definition->common.module->provided->typeNameLen,
	p_ESP32_TouchGUI1_Definition->common.module->provided->typeName);
  #endif

// ------------------------------------------------------------------------------------------------

  // get table of function callbacks provided & made accessible from stage 1 Module
  ESP32_SPI_ProvidedByModule_t* p_ESP32_SPI_provided_fn = (ESP32_SPI_ProvidedByModule_t*)
	p_ESP32_TouchGUI1_Definition->p_ESP32_SPI_Definition->common.module->provided;

  // Free this Definitions display (SPI device) from SPI bus host
  p_retMsg = p_ESP32_SPI_provided_fn->ESP32_SPI_bus_remove_deviceFn(p_ESP32_TouchGUI1_Definition->p_disp_handle);

  // could not remove device from spi bus
  if (p_retMsg) goto error_cancel_undefine_1;

  // the ESP32_SPI_device_interface_config_t is allocated here
  free(p_ESP32_TouchGUI1_Definition->p_disp_interface_config);

