mattehicks/SCDE/components/ESP32_TouchGUI1_Module/ESP32_TouchGUI1_Module.c
	// Reset DMA
	ESP32_TouchGUI1_Definition->disp_handle->host->hw->dma_conf.val |= SPI_OUT_RST|SPI_IN_RST|SPI_AHBM_RST|SPI_AHBM_FIFO_RST;
	ESP32_TouchGUI1_Definition->disp_handle->host->hw->dma_out_link.start=0;
	ESP32_TouchGUI1_Definition->disp_handle->host->hw->dma_in_link.start=0;
	ESP32_TouchGUI1_Definition->disp_handle->host->hw->dma_conf.val &= ~(SPI_OUT_RST|SPI_IN_RST|SPI_AHBM_RST|SPI_AHBM_FIFO_RST);
	ESP32_TouchGUI1_Definition->disp_handle->host->hw->dma_conf.out_data_burst_en=1;
	_dma_sending = 0;
  }

  return ESP_OK;
}


*/
//-------------------------------
esp_err_t IRAM_ATTR 
disp_select(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition)
{
  // get table of function callbacks provided & made accessible from stage 1 Module
  ESP32_SPI_ProvidedByModule_t* ESP32_SPI_provided_fn = (ESP32_SPI_ProvidedByModule_t*)
	ESP32_TouchGUI1_Definition->p_ESP32_SPI_Definition->common.module->provided;
/*
  wait_trans_finish(ESP32_TouchGUI1_Definition, 1);
  return ESP32_SPI_provided_fn->ESP32_SPI_spi_device_selectFn(ESP32_TouchGUI1_Definition->ESP32_SPI_Definition, ESP32_TouchGUI1_Definition->disp_handle, 0);*/
 return ESP_OK;
}



//---------------------------------
esp_err_t IRAM_ATTR 
disp_deselect(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition)
{
  // get table of function callbacks provided & made accessible from stage 1 Module
  ESP32_SPI_ProvidedByModule_t* ESP32_SPI_provided_fn = (ESP32_SPI_ProvidedByModule_t*)
	ESP32_TouchGUI1_Definition->p_ESP32_SPI_Definition->common.module->provided;

//  wait_trans_finish(ESP32_TouchGUI1_Definition, 1);

//  return ESP32_SPI_provided_fn->ESP32_SPI_spi_device_deselectFn(ESP32_TouchGUI1_Definition->disp_handle);
return ESP_OK;
}

/*

// verschieben zu ESP32_SPI_Module 
// _ private Fn to start spi transfer
//---------------------------------------------------------------------------------------------------
static void IRAM_ATTR 
_spi_transfer_start(ESP32_SPI_Module_spi_device_handle_t spi_dev,
	int wrbits,
	int rdbits)
{
  // Load send buffer
  spi_dev->host->hw->user.usr_mosi_highpart = 0;
  spi_dev->host->hw->mosi_dlen.usr_mosi_dbitlen = wrbits-1;
  spi_dev->host->hw->user.usr_mosi = 1;

  if (rdbits) {

	spi_dev->host->hw->miso_dlen.usr_miso_dbitlen = rdbits;
	spi_dev->host->hw->user.usr_miso = 1;
  }

  else {

	spi_dev->host->hw->miso_dlen.usr_miso_dbitlen = 0;
	spi_dev->host->hw->user.usr_miso = 0;
  }

  // Start transfer
  spi_dev->host->hw->cmd.usr = 1;

  // Wait for SPI bus ready
  while (spi_dev->host->hw->cmd.usr);
}

*/



// Send command (1 byte) to spi device
//------------------------------------------------
void IRAM_ATTR 
ESP32_SPI_transfer_only_cmd(ESP32_SPI_device_handle_t spi_device_handle,
	const int8_t cmd)
{
  esp_err_t ret;

  ESP32_SPI_transaction_t t;

  memset(&t, 0, sizeof(t));	// Zero out the transaction

  t.length = 8;			// Command is 8 bits
  t.tx_buffer = &cmd;		// The data is the cmd itself
  t.user = (void*) 0;		// D/C needs to be set to 0 for cmd

  ret = ESP32_SPI_device_polling_transmit(spi_device_handle, &t);

  assert(ret == ESP_OK);	// Should have had no issues.
}



// Send data (len byte) to spi device
//------------------------------------------------
void IRAM_ATTR 
ESP32_SPI_transfer_only_data(ESP32_SPI_device_handle_t spi_device_handle,
	const uint8_t *data,
	int len)
{
  esp_err_t ret;

  if ( len == 0 ) return;	// no need to send anything

  ESP32_SPI_transaction_t t;

  memset(&t, 0, sizeof(t));	// Zero out the transaction

  t.length = len * 8;		// Data is len * 8 bits
  t.tx_buffer = data;		// The data is the cmd itself
  t.user = (void*) 1;		// D/C needs to be set to 1 for data

  ret = ESP32_SPI_device_polling_transmit(spi_device_handle, &t);

  assert(ret == ESP_OK);	// Should have had no issues.
}



// unklare funktion, setzt auch andere register? PIN_NUM_DC? Daten queuen?
// Set the address window for display write & read commands, display must be selected
//---------------------------------------------------------------------------------------------------
static void IRAM_ATTR 
//TFT_set_spitransfer_addrwin
disp_spi_transfer_addrwin(ESP32_SPI_device_handle_t spi_device_handle,
	uint16_t x1,
	uint16_t x2,
	uint16_t y1,
	uint16_t y2)
{
  // width x data temp
  uint32_t xwd;

  // calculate width data
  xwd  = (uint32_t) (x1 >> 8);
  xwd |= (uint32_t) (x1 & 0xff) << 8;
  xwd |= (uint32_t) (x2 >> 8) << 16;
  xwd |= (uint32_t) (x2 & 0xff) << 24;

  ESP32_SPI_polling_transmit_cmd_and_data(spi_device_handle,
	TFT_CASET, &xwd, 4);

 // width y data temp
  uint32_t ywd;

 // calculate width data
  ywd  = (uint32_t) (y1 >> 8);
  ywd |= (uint32_t) (y1 & 0xff) << 8;
  ywd |= (uint32_t) (y2 >> 8) << 16;
  ywd |= (uint32_t) (y2 & 0xff) << 24;

  ESP32_SPI_polling_transmit_cmd_and_data(spi_device_handle,
	TFT_PASET, &ywd, 4);
}



// Convert color to gray scale
//----------------------------------------------
static color_t IRAM_ATTR 
color2gs(color_t color)
{
  color_t _color;

  float gs_clr = GS_FACT_R * color.r + GS_FACT_G * color.g + GS_FACT_B * color.b;

  if (gs_clr > 255) gs_clr = 255;

  _color.r = (uint8_t)gs_clr;
  _color.g = (uint8_t)gs_clr;
  _color.b = (uint8_t)gs_clr;

  return _color;
}



// Set display pixel at given coordinates to given color
//------------------------------------------------------------------------
void IRAM_ATTR 
drawPixel(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int16_t x,
	int16_t y,
	color_t color,
	uint8_t sel)
{
printf("drawpixel");
/*
	if (!(ESP32_TouchGUI1_Definition->disp_handle->cfg.flags & LB_SPI_DEVICE_HALFDUPLEX)) return;

	if (sel) {
		if (disp_select(ESP32_TouchGUI1_Definition)) return;
	}
	else wait_trans_finish(ESP32_TouchGUI1_Definition, 1);

	uint32_t wd = 0;
    color_t _color = color;
	if (ESP32_TouchGUI1_Definition->gray_scale) _color = color2gs(color);

    taskDISABLE_INTERRUPTS();
	disp_spi_transfer_addrwin(ESP32_TouchGUI1_Definition->disp_handle, x, x+1, y, y+1);

	// Send RAM WRITE command
    gpio_set_level(PIN_NUM_DC, 0);
    ESP32_TouchGUI1_Definition->disp_handle->host->hw->data_buf[0] = (uint32_t)TFT_RAMWR;
	ESP32_TouchGUI1_Definition->disp_handle->host->hw->mosi_dlen.usr_mosi_dbitlen = 7;
	ESP32_TouchGUI1_Definition->disp_handle->host->hw->cmd.usr = 1;		// Start transfer
	while (ESP32_TouchGUI1_Definition->disp_handle->host->hw->cmd.usr);	// Wait for SPI bus ready

	wd = (uint32_t)_color.r;
	wd |= (uint32_t)_color.g << 8;
	wd |= (uint32_t)_color.b << 16;

