mattehicks/SCDE/components/ESP32_TouchGUI1_Module/ESP32_TouchGUI1_Module.c
    // Set DC to 1 (data mode);
	gpio_set_level(PIN_NUM_DC, 1);

	ESP32_TouchGUI1_Definition->disp_handle->host->hw->data_buf[0] = wd;
	ESP32_TouchGUI1_Definition->disp_handle->host->hw->mosi_dlen.usr_mosi_dbitlen = 23;
	ESP32_TouchGUI1_Definition->disp_handle->host->hw->cmd.usr = 1;		// Start transfer
	while (ESP32_TouchGUI1_Definition->disp_handle->host->hw->cmd.usr);	// Wait for SPI bus ready

    taskENABLE_INTERRUPTS();
   if (sel) disp_deselect(ESP32_TouchGUI1_Definition);
*/
}

/*

//-----------------------------------------------------------
static void IRAM_ATTR 
_dma_send(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition,
	uint8_t *data,
	uint32_t size)
{
  // get table of function callbacks provided & made accessible from stage 1 Module
  ESP32_SPI_ProvidedByModule_t* ESP32_SPI_provided_fn = (ESP32_SPI_ProvidedByModule_t*)
	ESP32_TouchGUI1_Definition->ESP32_SPI_Definition->common.module->provided;

    //Fill DMA descriptors
    ESP32_SPI_provided_fn->ESP32_SPI_spi_dmaworkaround_transfer_activeFn(ESP32_TouchGUI1_Definition->disp_handle->host->dma_chan); //mark channel as active
    ESP32_SPI_provided_fn->ESP32_SPI_spi_setup_dma_desc_linksFn(ESP32_TouchGUI1_Definition->disp_handle->host->dmadesc_tx, size, data, false);

    ESP32_TouchGUI1_Definition->disp_handle->host->hw->user.usr_mosi_highpart=0;
    ESP32_TouchGUI1_Definition->disp_handle->host->hw->dma_out_link.addr=(int)(&ESP32_TouchGUI1_Definition->disp_handle->host->dmadesc_tx[0]) & 0xFFFFF;
    ESP32_TouchGUI1_Definition->disp_handle->host->hw->dma_out_link.start=1;
    ESP32_TouchGUI1_Definition->disp_handle->host->hw->user.usr_mosi_highpart=0;

	ESP32_TouchGUI1_Definition->disp_handle->host->hw->mosi_dlen.usr_mosi_dbitlen = (size * 8) - 1;

	_dma_sending = 1;
	// Start transfer
	ESP32_TouchGUI1_Definition->disp_handle->host->hw->cmd.usr = 1;
}



//---------------------------------------------------------------------------
static void IRAM_ATTR 
_direct_send(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, color_t *color, uint32_t len, uint8_t rep)
{
	uint32_t cidx = 0;	// color buffer index
	uint32_t wd = 0;
	int idx = 0;
	int bits = 0;
	int wbits = 0;

    taskDISABLE_INTERRUPTS();

	color_t _color = color[0];

	if ((rep) && (ESP32_TouchGUI1_Definition->gray_scale)) _color = color2gs(color[0]);

	while (len) {
		// ** Get color data from color buffer **
		if (rep == 0) {
			if (ESP32_TouchGUI1_Definition->gray_scale) _color = color2gs(color[cidx]);
			else _color = color[cidx];
		}

		wd |= (uint32_t)_color.r << wbits;
		wbits += 8;
		if (wbits == 32) {
			bits += wbits;
			wbits = 0;
			ESP32_TouchGUI1_Definition->disp_handle->host->hw->data_buf[idx++] = wd;
			wd = 0;
		}
		wd |= (uint32_t)_color.g << wbits;
		wbits += 8;
		if (wbits == 32) {
			bits += wbits;
			wbits = 0;
			ESP32_TouchGUI1_Definition->disp_handle->host->hw->data_buf[idx++] = wd;
			wd = 0;
		}
		wd |= (uint32_t)_color.b << wbits;
		wbits += 8;
		if (wbits == 32) {
			bits += wbits;
			wbits = 0;
			ESP32_TouchGUI1_Definition->disp_handle->host->hw->data_buf[idx++] = wd;
			wd = 0;
		}
    	len--;					// Decrement colors counter
        if (rep == 0) cidx++;	// if not repeating color, increment color buffer index
    }
	if (bits) {
		while (ESP32_TouchGUI1_Definition->disp_handle->host->hw->cmd.usr);						// Wait for SPI bus ready
		ESP32_TouchGUI1_Definition->disp_handle->host->hw->mosi_dlen.usr_mosi_dbitlen = bits-1;	// set number of bits to be sent
        ESP32_TouchGUI1_Definition->disp_handle->host->hw->cmd.usr = 1;							// Start transfer
	}
    taskENABLE_INTERRUPTS();
}

*/

// ================================================================
// === Main function to send data to display ======================
// If  rep==true:  repeat sending color data to display 'len' times
// If rep==false:  send 'len' color data from color buffer to display
// ** Device must already be selected and address window set **
// ================================================================
//----------------------------------------------------------------------------------------------
static void IRAM_ATTR 
_TFT_pushColorRep(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	color_t* color,
	uint32_t len, // len in pixel! (3 bytes?)
	uint8_t rep,
	uint8_t wait)
{
  if (len == 0) return;

  // send cmd: write to disp. ram
  ESP32_SPI_transfer_only_cmd(disp_handle, (const int8_t) TFT_RAMWR);

  // short transfer? helper does the job
  if ( ( len * 24 ) <= 512 ) {

	// ESP32_SPI_transfer_only_data(ESP32_TouchGUI1_Definition->disp_handle, int8_t TFT_RAMWR)
	// _direct_send(ESP32_TouchGUI1_Definition, color, len, rep);
//printf("short");
	ESP32_SPI_transfer_only_data(disp_handle,
		(uint8_t*) color,
		len * 3);
  }

  // false: we send len color data
  else if ( rep == 0 )  {

	// repare data (rgb - gs conversion)
	if (TFT_globals->gray_scale) {

		for ( int n = 0 ; n < len ; n++ ) {

			color[n] = color2gs(color[n]);
		}
	}
//printf("long");
	ESP32_SPI_transfer_only_data(disp_handle,
		(uint8_t*) color,
		len * 3);

	//_dma_send(ESP32_TouchGUI1_Definition, (uint8_t *)color, len * 3);
  }

  // Repeat color, more than 512 bits total
  else {
printf("other");
	color_t _color;
	uint32_t buf_colors;
	int buf_bytes, to_send;

	buf_colors = (( len > (TFT_globals->_width * 2 )) ? ( TFT_globals->_width * 2) : len);

	buf_bytes = buf_colors * 3;

	// Prepare color buffer of maximum 2 color lines
	trans_cline = heap_caps_malloc(buf_bytes, MALLOC_CAP_DMA);
	if (trans_cline == NULL) return;

	// Prepare fill color
	if (TFT_globals->gray_scale) _color = color2gs(color[0]);
	else _color = color[0];

	// Fill color buffer with fill color
	for ( uint32_t i = 0 ; i < buf_colors ; i++ ) {

		trans_cline[i] = _color;
	}

	// Send 'len' colors
	to_send = len;

	while (to_send > 0) {

		ESP32_SPI_transfer_only_data(disp_handle,
			(uint8_t*) trans_cline,
			( (to_send > buf_colors) ? buf_bytes : (to_send * 3) ) );

