mattehicks/SCDE/components/ESP32_TouchGUI1_Module/ESP32_TouchGUI1_Module.c
			to_send -= buf_colors;
	}
  }





/*
	if (len == 0) return;
	if (!(ESP32_TouchGUI1_Definition->disp_handle->cfg.flags & LB_SPI_DEVICE_HALFDUPLEX)) return;

	// Send RAM WRITE command
    gpio_set_level(PIN_NUM_DC, 0);
    ESP32_TouchGUI1_Definition->disp_handle->host->hw->data_buf[0] = (uint32_t)TFT_RAMWR;
	ESP32_TouchGUI1_Definition->disp_handle->host->hw->mosi_dlen.usr_mosi_dbitlen = 7;
	ESP32_TouchGUI1_Definition->disp_handle->host->hw->cmd.usr = 1;		// Start transfer
	while (ESP32_TouchGUI1_Definition->disp_handle->host->hw->cmd.usr);	// Wait for SPI bus ready

	gpio_set_level(PIN_NUM_DC, 1);								// Set DC to 1 (data mode);

	if ((len*24) <= 512) {

		_direct_send(ESP32_TouchGUI1_Definition, color, len, rep);

	}
	else if (rep == 0)  {
		// ==== use DMA transfer ====
		// ** Prepare data
		if (ESP32_TouchGUI1_Definition->gray_scale) {
			for (int n=0; n<len; n++) {
				color[n] = color2gs(color[n]);
			}
	    }

	    _dma_send(ESP32_TouchGUI1_Definition, (uint8_t *)color, len*3);
	}
	else {
		// ==== Repeat color, more than 512 bits total ====

		color_t _color;
		uint32_t buf_colors;
		int buf_bytes, to_send;

		
//		to_send = len;
//		while (to_send > 0) {
//			wait_trans_finish(0);
//			_direct_send(color, ((to_send > 21) ? 21 : to_send), rep);
//			to_send -= 21;
//		}
		

		buf_colors = ((len > (ESP32_TouchGUI1_Definition->_width*2)) ? (ESP32_TouchGUI1_Definition->_width*2) : len);
		buf_bytes = buf_colors * 3;

		// Prepare color buffer of maximum 2 color lines
		trans_cline = heap_caps_malloc(buf_bytes, MALLOC_CAP_DMA);
		if (trans_cline == NULL) return;

		// Prepare fill color
		if (ESP32_TouchGUI1_Definition->gray_scale) _color = color2gs(color[0]);
		else _color = color[0];

		// Fill color buffer with fill color
		for (uint32_t i=0; i<buf_colors; i++) {
			trans_cline[i] = _color;
		}

		// Send 'len' colors
		to_send = len;
		while (to_send > 0) {
			wait_trans_finish(ESP32_TouchGUI1_Definition, 0);
			_dma_send(ESP32_TouchGUI1_Definition, (uint8_t *)trans_cline, ((to_send > buf_colors) ? buf_bytes : (to_send*3)));
			to_send -= buf_colors;
		}
	}

	if (wait) wait_trans_finish(ESP32_TouchGUI1_Definition, 1);
*/
}



// Write 'len' repeated color data to TFT 'window' (x1,y2),(x2,y2)
//-------------------------------------------------------------------------------------------
void IRAM_ATTR 
TFT_pushColorRep(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int x1,
	int y1,
	int x2,
	int y2,
	color_t color,
	uint32_t len)
{
  // set address window
  disp_spi_transfer_addrwin(disp_handle, x1, x2, y1, y2);

  // send data
  _TFT_pushColorRep(disp_handle, TFT_globals, &color, len, 1, 1);
}



// Write 'len' color data to TFT 'window' (x1,y2),(x2,y2) from given buffer
//-----------------------------------------------------------------------------------
void IRAM_ATTR 
send_data(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int x1,
	int y1,
	int x2,
	int y2,
	uint32_t len,
 	color_t *buf)
{
  // set address window
  disp_spi_transfer_addrwin(disp_handle, x1, x2, y1, y2);

  // send data
  _TFT_pushColorRep(disp_handle, TFT_globals, buf, len, 0, 0);
}





// Reads 'len' pixels/colors from the TFT's GRAM 'window'
// 'buf' is an array of bytes with 1st byte reserved for reading 1 dummy byte
// and the rest is actually an array of color_t values
//--------------------------------------------------------------------------------------------
int IRAM_ATTR 
read_data(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int x1,
	int y1,
	int x2,
	int y2,
	int len,
	uint8_t *buf,
	uint8_t set_sp)
{
/*
  // get table of function callbacks provided & made accessible from stage 1 Module
  ESP32_SPI_ProvidedByModule_t* ESP32_SPI_provided_fn = (ESP32_SPI_ProvidedByModule_t*)
	ESP32_TouchGUI1_Definition->ESP32_SPI_Definition->common.module->provided;

	ESP32_SPI_Module_spi_transaction_t t;
	uint32_t current_clock = 0;

    memset(&t, 0, sizeof(t));  //Zero out the transaction
	memset(buf, 0, len*sizeof(color_t));

	if (set_sp) {
		if (disp_deselect(ESP32_TouchGUI1_Definition) != ESP_OK) return -1;
		// Change spi clock if needed
		current_clock = ESP32_SPI_provided_fn->ESP32_SPI_spi_get_speedFn(ESP32_TouchGUI1_Definition->ESP32_SPI_Definition, ESP32_TouchGUI1_Definition->disp_handle);
		if (max_rdclock < current_clock) ESP32_SPI_provided_fn->ESP32_SPI_spi_set_speedFn(ESP32_TouchGUI1_Definition->ESP32_SPI_Definition, ESP32_TouchGUI1_Definition->disp_handle, max_rdclock);
	}

	if (disp_select(ESP32_TouchGUI1_Definition) != ESP_OK) return -2;

	// ** Send address window **
	disp_spi_transfer_addrwin(ESP32_TouchGUI1_Definition->disp_handle, x1, x2, y1, y2);

    // ** GET pixels/colors **
	ESP32_SPI_transfer_only_cmd(ESP32_TouchGUI1_Definition->disp_handle, TFT_RAMRD);

    t.length=0;                //Send nothing
    t.tx_buffer=NULL;
    t.rxlength=8*((len*3)+1);  //Receive size in bits
    t.rx_buffer=buf;
    //t.user = (void*)1;

	esp_err_t res = 
	ESP32_SPI_provided_fn->ESP32_SPI_spi_transfer_dataFn(ESP32_TouchGUI1_Definition->ESP32_SPI_Definition, ESP32_TouchGUI1_Definition->disp_handle, &t); // Receive using direct mode

	disp_deselect(ESP32_TouchGUI1_Definition);

	if (set_sp) {
		// Restore spi clock if needed
		if (max_rdclock < current_clock) ESP32_SPI_provided_fn->ESP32_SPI_spi_set_speedFn(ESP32_TouchGUI1_Definition->ESP32_SPI_Definition,  ESP32_TouchGUI1_Definition->disp_handle, current_clock);
	}
*/
esp_err_t res = 0;
    return res;
}



// Reads one pixel/color from the TFT's GRAM at position (x,y)
//-----------------------------------------------
color_t 
IRAM_ATTR 
readPixel(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	int16_t x,
	int16_t y)
{

    uint8_t color_buf[sizeof(color_t)+1] = {0};

//    read_data(ESP32_TouchGUI1_Definition, x, y, x+1, y+1, 1, color_buf, 1);

    color_t color;
	color.r = color_buf[1];
	color.g = color_buf[2];
	color.b = color_buf[3];
	return color;
}
/*


// get 16-bit data from touch controller for specified type
// ** Touch device must already be selected **
//----------------------------------------


int IRAM_ATTR 
touch_get_data(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition,
	uint8_t type)
{
  // get table of function callbacks provided & made accessible from stage 1 Module
  ESP32_SPI_ProvidedByModule_t* ESP32_SPI_provided_fn = (ESP32_SPI_ProvidedByModule_t*)
	ESP32_TouchGUI1_Definition->ESP32_SPI_Definition->common.module->provided;

    
//    esp_err_t ret;
//    spi_lobo_transaction_t t;
//    memset(&t, 0, sizeof(t));            //Zero out the transaction
//    uint8_t rxdata[2] = {0};

