mattehicks/SCDE/components/ESP32_TouchGUI1_Module/ESP32_TouchGUI1_Module.c
//    // send command byte & receive 2 byte response
//    t.rxlength=8*2;
//    t.rx_buffer=&rxdata;
//    t.command = type;

//    ret = spi_lobo_transfer_data(ts_spi, &t);    // Transmit using direct mode

//    if (ret != ESP_OK) return -1;
//    return (((int)(rxdata[0] << 8) | (int)(rxdata[1])) >> 4);
    
    ESP32_SPI_provided_fn->ESP32_SPI_spi_device_selectFn(ESP32_TouchGUI1_Definition->ESP32_SPI_Definition, ESP32_TouchGUI1_Definition->ts_spi, 0);

    ESP32_TouchGUI1_Definition->ts_spi->host->hw->data_buf[0] = type;
    _spi_transfer_start(ESP32_TouchGUI1_Definition->ts_spi, 24, 24);
    uint16_t res = (uint16_t)(ESP32_TouchGUI1_Definition->ts_spi->host->hw->data_buf[0] >> 8);

    ESP32_SPI_provided_fn->ESP32_SPI_spi_device_deselectFn(ESP32_TouchGUI1_Definition->ts_spi);

    return res;
}




// ==== STMPE610 ===============================================================




// ----- STMPE610 --------------------------------------------------------------------------



// Send 1 byte display command, display must be selected
//---------------------------------------------------------
static void IRAM_ATTR 
stmpe610_write_reg(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition,
	uint8_t reg,
	uint8_t val)
{
  // get table of function callbacks provided & made accessible from stage 1 Module
  ESP32_SPI_ProvidedByModule_t* ESP32_SPI_provided_fn = (ESP32_SPI_ProvidedByModule_t*)
	ESP32_TouchGUI1_Definition->ESP32_SPI_Definition->common.module->provided;

    ESP32_SPI_provided_fn->ESP32_SPI_spi_device_selectFn(ESP32_TouchGUI1_Definition->ESP32_SPI_Definition, ESP32_TouchGUI1_Definition->ts_spi, 0);

    ESP32_TouchGUI1_Definition->ts_spi->host->hw->data_buf[0] = (val << 8) | reg;
    _spi_transfer_start(ESP32_TouchGUI1_Definition->ts_spi, 16, 0);

    ESP32_SPI_provided_fn->ESP32_SPI_spi_device_deselectFn(ESP32_TouchGUI1_Definition->ts_spi);
}



//-----------------------------------------------



static uint8_t IRAM_ATTR 
stmpe610_read_byte(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition,
	uint8_t reg)
{
  // get table of function callbacks provided & made accessible from stage 1 Module
  ESP32_SPI_ProvidedByModule_t* ESP32_SPI_provided_fn = (ESP32_SPI_ProvidedByModule_t*)
	ESP32_TouchGUI1_Definition->ESP32_SPI_Definition->common.module->provided;

    ESP32_SPI_provided_fn->ESP32_SPI_spi_device_selectFn(ESP32_TouchGUI1_Definition->ESP32_SPI_Definition, ESP32_TouchGUI1_Definition->ts_spi, 0);

    ESP32_TouchGUI1_Definition->ts_spi->host->hw->data_buf[0] = (reg << 8) | (reg | 0x80);
    _spi_transfer_start(ESP32_TouchGUI1_Definition->ts_spi, 16, 16);
    uint8_t res = ESP32_TouchGUI1_Definition->ts_spi->host->hw->data_buf[0] >> 8;

    ESP32_SPI_provided_fn->ESP32_SPI_spi_device_deselectFn(ESP32_TouchGUI1_Definition->ts_spi);
    return res;
}



//-----------------------------------------
static uint16_t IRAM_ATTR
stmpe610_read_word(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, 
	uint8_t reg)
{
  // get table of function callbacks provided & made accessible from stage 1 Module
  ESP32_SPI_ProvidedByModule_t* ESP32_SPI_provided_fn = (ESP32_SPI_ProvidedByModule_t*)
	ESP32_TouchGUI1_Definition->ESP32_SPI_Definition->common.module->provided;

    ESP32_SPI_provided_fn->ESP32_SPI_spi_device_selectFn(ESP32_TouchGUI1_Definition->ESP32_SPI_Definition, ESP32_TouchGUI1_Definition->ts_spi, 0);

    ESP32_TouchGUI1_Definition->ts_spi->host->hw->data_buf[0] = ((((reg+1) << 8) | ((reg+1) | 0x80)) << 16) | (reg << 8) | (reg | 0x80);
    _spi_transfer_start(ESP32_TouchGUI1_Definition->ts_spi, 32, 32);
    uint16_t res = (uint16_t)(ESP32_TouchGUI1_Definition->ts_spi->host->hw->data_buf[0] & 0xFF00);
    res |= (uint16_t)(ESP32_TouchGUI1_Definition->ts_spi->host->hw->data_buf[0] >> 24);

     ESP32_SPI_provided_fn->ESP32_SPI_spi_device_deselectFn(ESP32_TouchGUI1_Definition->ts_spi);
    return res;
}



//-----------------------



uint32_t stmpe610_getID(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition)
{
    uint16_t tid = stmpe610_read_word(ESP32_TouchGUI1_Definition, 0);
    uint8_t tver = stmpe610_read_byte(ESP32_TouchGUI1_Definition, 2);
    return (tid << 8) | tver;
}



//==================



void 
stmpe610_Init(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition)
{
    stmpe610_write_reg(ESP32_TouchGUI1_Definition, STMPE610_REG_SYS_CTRL1, 0x02);        // Software chip reset

    vTaskDelay(10 / portTICK_RATE_MS);

    stmpe610_write_reg(ESP32_TouchGUI1_Definition, STMPE610_REG_SYS_CTRL2, 0x04);        // Temperature sensor clock off, GPIO clock off, touch clock on, ADC clock on

    stmpe610_write_reg(ESP32_TouchGUI1_Definition, STMPE610_REG_INT_EN, 0x00);           // Don't Interrupt on INT pin

    stmpe610_write_reg(ESP32_TouchGUI1_Definition, STMPE610_REG_ADC_CTRL1, 0x48);        // ADC conversion time = 80 clock ticks, 12-bit ADC, internal voltage refernce

    vTaskDelay(2 / portTICK_RATE_MS);

    stmpe610_write_reg(ESP32_TouchGUI1_Definition, STMPE610_REG_ADC_CTRL2, 0x01);        // ADC speed 3.25MHz
    stmpe610_write_reg(ESP32_TouchGUI1_Definition, STMPE610_REG_GPIO_AF, 0x00);          // GPIO alternate function - OFF
    stmpe610_write_reg(ESP32_TouchGUI1_Definition, STMPE610_REG_TSC_CFG, 0xE3);          // Averaging 8, touch detect delay 1ms, panel driver settling time 1ms
    stmpe610_write_reg(ESP32_TouchGUI1_Definition, STMPE610_REG_FIFO_TH, 0x01);          // FIFO threshold = 1
    stmpe610_write_reg(ESP32_TouchGUI1_Definition, STMPE610_REG_FIFO_STA, 0x01);         // FIFO reset enable
    stmpe610_write_reg(ESP32_TouchGUI1_Definition, STMPE610_REG_FIFO_STA, 0x00);         // FIFO reset disable
    stmpe610_write_reg(ESP32_TouchGUI1_Definition, STMPE610_REG_TSC_FRACT_XYZ, 0x07);    // Z axis data format
    stmpe610_write_reg(ESP32_TouchGUI1_Definition, STMPE610_REG_TSC_I_DRIVE, 0x01);      // max 50mA touchscreen line current
    stmpe610_write_reg(ESP32_TouchGUI1_Definition, STMPE610_REG_TSC_CTRL, 0x30);         // X&Y&Z, 16 reading window
    stmpe610_write_reg(ESP32_TouchGUI1_Definition, STMPE610_REG_TSC_CTRL, 0x31);         // X&Y&Z, 16 reading window, TSC enable
    stmpe610_write_reg(ESP32_TouchGUI1_Definition, STMPE610_REG_INT_STA, 0xFF);          // Clear all interrupts
    stmpe610_write_reg(ESP32_TouchGUI1_Definition, STMPE610_REG_INT_CTRL, 0x00);         // Level interrupt, disable interrupts
}



//===========================================================



int 
stmpe610_get_touch(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition,
	uint16_t *x,
	uint16_t *y,
	uint16_t *z)
{
	if (!(stmpe610_read_byte(ESP32_TouchGUI1_Definition, STMPE610_REG_TSC_CTRL) & 0x80)) return 0;

