mattehicks/SCDE/components/ESP32_TouchGUI1_Module/ESP32_TouchGUI1_Module.c
    // Get touch data
    uint8_t fifo_size = stmpe610_read_byte(ESP32_TouchGUI1_Definition, STMPE610_REG_FIFO_SIZE);
    while (fifo_size < 2) {
    	if (!(stmpe610_read_byte(ESP32_TouchGUI1_Definition, STMPE610_REG_TSC_CTRL) & 0x80)) return 0;
        fifo_size = stmpe610_read_byte(ESP32_TouchGUI1_Definition, STMPE610_REG_FIFO_SIZE);
    }
    while (fifo_size > 120) {
    	if (!(stmpe610_read_byte(ESP32_TouchGUI1_Definition, STMPE610_REG_TSC_CTRL) & 0x80)) return 0;
        *x = stmpe610_read_word(ESP32_TouchGUI1_Definition, STMPE610_REG_TSC_DATA_X);
        *y = stmpe610_read_word(ESP32_TouchGUI1_Definition, STMPE610_REG_TSC_DATA_Y);
        *z = stmpe610_read_byte(ESP32_TouchGUI1_Definition, STMPE610_REG_TSC_DATA_Z);
        fifo_size = stmpe610_read_byte(ESP32_TouchGUI1_Definition, STMPE610_REG_FIFO_SIZE);
    }
    for (uint8_t i=0; i < (fifo_size-1); i++) {
        *x = stmpe610_read_word(ESP32_TouchGUI1_Definition, STMPE610_REG_TSC_DATA_X);
        *y = stmpe610_read_word(ESP32_TouchGUI1_Definition, STMPE610_REG_TSC_DATA_Y);
        *z = stmpe610_read_byte(ESP32_TouchGUI1_Definition, STMPE610_REG_TSC_DATA_Z);
    }

    *x = 4096 - *x;
    
    // Clear the rest of the fifo
//    {
//        stmpe610_write_reg(STMPE610_REG_FIFO_STA, 0x01);		// FIFO reset enable
//        stmpe610_write_reg(STMPE610_REG_FIFO_STA, 0x00);		// FIFO reset disable
//    }
    
	return 1;
}




// ==== STMPE610 ===========================================================================



// Find maximum spi clock for successful read from display RAM
// ** Must be used AFTER the display is initialized **
//======================
uint32_t 
find_rd_speed(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition)
{
  // get table of function callbacks provided & made accessible from stage 1 Module
  ESP32_SPI_ProvidedByModule_t* ESP32_SPI_provided_fn = (ESP32_SPI_ProvidedByModule_t*)
	ESP32_TouchGUI1_Definition->ESP32_SPI_Definition->common.module->provided;
 
	esp_err_t ret;
	color_t color;
	uint32_t max_speed = 1000000;
    uint32_t change_speed, cur_speed;
    int line_check;
    color_t *color_line = NULL;
    uint8_t *line_rdbuf = NULL;
    uint8_t gs = ESP32_TouchGUI1_Definition->gray_scale;

    ESP32_TouchGUI1_Definition->gray_scale = 0;
    cur_speed = ESP32_SPI_provided_fn->ESP32_SPI_spi_get_speedFn(ESP32_TouchGUI1_Definition->ESP32_SPI_Definition, ESP32_TouchGUI1_Definition->disp_handle);

	color_line = malloc(ESP32_TouchGUI1_Definition->_width*3);
    if (color_line == NULL) goto exit;

    line_rdbuf = malloc((ESP32_TouchGUI1_Definition->_width*3)+1);
	if (line_rdbuf == NULL) goto exit;

	color_t *rdline = (color_t *)(line_rdbuf+1);

	// Fill test line with colors
	color = (color_t){0xEC,0xA8,0x74};
	for (int x=0; x<ESP32_TouchGUI1_Definition->_width; x++) {
		color_line[x] = color;
	}

	// Find maximum read spi clock
	for (uint32_t speed=2000000; speed<=cur_speed; speed += 1000000) {
		change_speed = ESP32_SPI_provided_fn->ESP32_SPI_spi_set_speedFn(ESP32_TouchGUI1_Definition->ESP32_SPI_Definition, ESP32_TouchGUI1_Definition->disp_handle, speed);
		if (change_speed == 0) goto exit;

		memset(line_rdbuf, 0, ESP32_TouchGUI1_Definition->_width*sizeof(color_t)+1);

		if (disp_select(ESP32_TouchGUI1_Definition)) goto exit;
		// Write color line
		send_data(ESP32_TouchGUI1_Definition, 0, ESP32_TouchGUI1_Definition->_height/2, ESP32_TouchGUI1_Definition->_width-1, ESP32_TouchGUI1_Definition->_height/2, ESP32_TouchGUI1_Definition->_width, color_line);
		if (disp_deselect(ESP32_TouchGUI1_Definition)) goto exit;

		// Read color line
		ret = read_data(ESP32_TouchGUI1_Definition, 0, ESP32_TouchGUI1_Definition->_height/2, ESP32_TouchGUI1_Definition->_width-1, ESP32_TouchGUI1_Definition->_height/2, ESP32_TouchGUI1_Definition->_width, line_rdbuf, 0);

		// Compare
		line_check = 0;
		if (ret == ESP_OK) {
			for (int y=0; y<ESP32_TouchGUI1_Definition->_width; y++) {
				if ((color_line[y].r & 0xFC) != (rdline[y].r & 0xFC)) line_check = 1;
				else if ((color_line[y].g & 0xFC) != (rdline[y].g & 0xFC)) line_check = 1;
				else if ((color_line[y].b & 0xFC) != (rdline[y].b & 0xFC)) line_check =  1;
				if (line_check) break;
			}
		}
		else line_check = ret;

		if (line_check) break;
		max_speed = speed;
	}

exit:
    ESP32_TouchGUI1_Definition->gray_scale = gs;
	if (line_rdbuf) free(line_rdbuf);
	if (color_line) free(color_line);

	// restore spi clk
	change_speed = ESP32_SPI_provided_fn->ESP32_SPI_spi_set_speedFn(ESP32_TouchGUI1_Definition->ESP32_SPI_Definition, ESP32_TouchGUI1_Definition->disp_handle, cur_speed);

	return max_speed;
}



*/

//==================================
void 
_tft_setRotation(ESP32_SPI_device_handle_t disp_handle,
	TFTGlobals_t* TFT_globals,
	uint8_t rot)
{
  uint8_t rotation = rot & 3; // can't be higher than 3
  uint8_t send = 1;
  uint8_t madctl = 0;
  uint16_t tmp;

  if ((rotation & 1)) {

	// in landscape modes must be width > height
	if (TFT_globals->_width < TFT_globals->_height) {

		tmp = TFT_globals->_width;
            	TFT_globals->_width  = TFT_globals->_height;
           	TFT_globals->_height = tmp;
	}
  }

  else {

	// in portrait modes must be width < height
        if (TFT_globals->_width > TFT_globals->_height) {

		tmp = TFT_globals->_width;

		TFT_globals->_width  = TFT_globals->_height;

		TFT_globals->_height = tmp;
        }
    }

    #if TFT_INVERT_ROTATION
    switch (rotation) {
        case PORTRAIT:
        madctl = (MADCTL_MV | TFT_RGB_BGR);
        break;
        case LANDSCAPE:
        madctl = (MADCTL_MX | TFT_RGB_BGR);
        break;
        case PORTRAIT_FLIP:
        madctl = (MADCTL_MV | TFT_RGB_BGR);
        break;
        case LANDSCAPE_FLIP:
        madctl = (MADCTL_MY | TFT_RGB_BGR);
        break;
    }
    #elif TFT_INVERT_ROTATION1
    switch (rotation) {
        case PORTRAIT:
        madctl = (MADCTL_MY | MADCTL_MX | TFT_RGB_BGR);
        break;
        case LANDSCAPE:
        madctl = (MADCTL_MY | MADCTL_MV | TFT_RGB_BGR);
        break;
        case PORTRAIT_FLIP:
        madctl = (TFT_RGB_BGR);
        break;
        case LANDSCAPE_FLIP:
        madctl = (MADCTL_MX | MADCTL_MV | TFT_RGB_BGR);
        break;
    }
    #elif TFT_INVERT_ROTATION2
    switch (rotation) {
        case PORTRAIT:
        madctl = (MADCTL_MX | MADCTL_MV | TFT_RGB_BGR);
        break;
        case LANDSCAPE:
        madctl = (TFT_RGB_BGR);
        break;
        case PORTRAIT_FLIP:
        madctl = (MADCTL_MY | MADCTL_MV | TFT_RGB_BGR);
        break;
        case LANDSCAPE_FLIP:
        madctl = (MADCTL_MY | MADCTL_MX | TFT_RGB_BGR);
        break;
    }
    #else
    switch (rotation) {
        case PORTRAIT:
        madctl = (MADCTL_MX | TFT_RGB_BGR);
        break;
        case LANDSCAPE:
        madctl = (MADCTL_MV | TFT_RGB_BGR);
        break;
        case PORTRAIT_FLIP:
        madctl = (MADCTL_MY | TFT_RGB_BGR);
        break;
        case LANDSCAPE_FLIP:
        madctl = (MADCTL_MX | MADCTL_MY | MADCTL_MV | TFT_RGB_BGR);
        break;
    }
    #endif

