mattehicks/SCDE/components/ESP32_TouchGUI1_Module/ESP32_TouchGUI1_Module.c
  if (send) {

	ESP32_SPI_polling_transmit_cmd_and_data(disp_handle,
		TFT_MADCTL, &madctl, 1);
  }
}







/**
 * --------------------------------------------------------------------------------------------------
 *  FName: TFT_display_init (Write an Command List)
 *  Desc: Initialize the display + set orientation + clear
 *  Info: 
 *  Para: ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition -> current_Definition handle
 *        ESP32_SPI_Module_spi_device_handle_t spi -> the spi device that should receive the cmds
 *	  const uint8_t *addr -> the Command List Table, including delays
 *  Rets: -/-
 * --------------------------------------------------------------------------------------------------
 */
// Initialize the display
// ====================
strTextMultiple_t*
TFT_display_init(ESP32_SPI_device_handle_t p_disp_handle,
	TFTGlobals_t* p_TFT_globals,
	DisplayConfig_t* p_display_config)
{
  // for Fn response msg
  strTextMultiple_t* p_retMsg = SCDE_OK;

  // display needs D/C -> setup
  gpio_pad_select_gpio(PIN_NUM_DC);
  gpio_set_direction(PIN_NUM_DC, GPIO_MODE_OUTPUT);
  gpio_set_level(PIN_NUM_DC, 0);



  #if USE_TOUCH
//  gpio_pad_select_gpio(PIN_NUM_TCS);
//  gpio_set_direction(PIN_NUM_TCS, GPIO_MODE_OUTPUT);
  #endif  
  
#if PIN_NUM_BCKL
  gpio_pad_select_gpio(PIN_NUM_BCKL);
  gpio_set_direction(PIN_NUM_BCKL, GPIO_MODE_OUTPUT);
  gpio_set_level(PIN_NUM_BCKL, PIN_BCKL_OFF);
#endif

#if PIN_NUM_RST
  gpio_pad_select_gpio(PIN_NUM_RST);
  gpio_set_direction(PIN_NUM_RST, GPIO_MODE_OUTPUT);
  gpio_set_level(PIN_NUM_RST, 0);
#endif



  esp_err_t ret;

  #if PIN_NUM_RST
  // reset the display
  gpio_set_level(PIN_NUM_RST, 0);
  vTaskDelay(20 / portTICK_RATE_MS);
  gpio_set_level(PIN_NUM_RST, 1);
  vTaskDelay(150 / portTICK_RATE_MS);
  #endif

  // get the display type
  uint8_t tft_disp_type = p_display_config->tft_disp_type;



  // Send the initialization commands
  if (tft_disp_type == DISP_TYPE_ILI9341) {

	ESP32_SPI_write_cmd_list(p_disp_handle, ILI9341_init);
  }

  else if (tft_disp_type == DISP_TYPE_ILI9488) {

	ESP32_SPI_write_cmd_list(p_disp_handle, ILI9488_init);
  }

  else if (tft_disp_type == DISP_TYPE_ST7789V) {

	ESP32_SPI_write_cmd_list(p_disp_handle, ST7789V_init);
  }

  else if (tft_disp_type == DISP_TYPE_ST7735) {

	ESP32_SPI_write_cmd_list(p_disp_handle, STP7735_init);
  }

  else if (tft_disp_type == DISP_TYPE_ST7735R) {

	ESP32_SPI_write_cmd_list(p_disp_handle, STP7735R_init);
	ESP32_SPI_write_cmd_list(p_disp_handle, Rcmd2green);
	ESP32_SPI_write_cmd_list(p_disp_handle, Rcmd3);
  }

  else if (tft_disp_type == DISP_TYPE_ST7735B) {

	ESP32_SPI_write_cmd_list(p_disp_handle, STP7735R_init);
	ESP32_SPI_write_cmd_list(p_disp_handle, Rcmd2red);
	ESP32_SPI_write_cmd_list(p_disp_handle, Rcmd3);

	uint8_t dt = 0xC0;

	ESP32_SPI_polling_transmit_cmd_and_data(p_disp_handle,
		TFT_MADCTL, &dt, 1);
  }

  else assert(0);

  // set rotation, clear screen

  _tft_setRotation(p_disp_handle, p_TFT_globals, PORTRAIT);

  TFT_pushColorRep(p_disp_handle, p_TFT_globals, 0, 0,
	p_TFT_globals->_width - 1, p_TFT_globals->_height - 1,
	(color_t) {0,0,0}, (uint32_t) (p_TFT_globals->_height * p_TFT_globals->_width) );

  // enable backlight
  #if PIN_NUM_BCKL
  gpio_set_level(PIN_NUM_BCKL, PIN_BCKL_ON);
  #endif

  return p_retMsg;
}





















































































































































//  ################# functions to move ################## 











// verschieben zu ESP32_SPI_Module PIN_NUM_DC?
// Send command with attached data to spi device, device must be selected !
/** eigentlich ins ESP32_SPI_Module ? über WriteFn?
 * --------------------------------------------------------------------------------------------------
 *  FName: Polling transmit commands and data
 *  Desc: Sends an command, followed by len bytes of data form *addr to the spi device
 *  Info: 
 *  Para: ESP32_SPI_Module_spi_device_handle_t spi_device_handle, -> the destination spi device
 *	  const uint8_t* data -> the data to send
 *        uint32_t len -> the length to send
 *  Rets: -/-
 * --------------------------------------------------------------------------------------------------
 */
void
ESP32_SPI_polling_transmit_cmd_and_data(ESP32_SPI_device_handle_t spi_device_handle,
	int8_t cmd,
	const uint8_t* p_data,
	uint32_t len)
{
  esp_err_t ret;

  ESP32_SPI_transaction_t t;

  // first the cmd
  memset(&t, 0, sizeof(t));	// zero struct
  t.length = 1 * 8;		// len is in bytes, transaction length is in bits
  t.tx_buffer = &cmd;		// the data is the cmd itself
  t.user = (void*) 0;		// D/C needs to be set to 0 for TX command

  ret = ESP32_SPI_device_polling_transmit(spi_device_handle, &t);

  assert(ret==ESP_OK);

  // then the data
  if ( len == 0 ) return; 	// no data ?

  memset(&t, 0, sizeof(t));	// zero struct
  t.length = len * 8;		// len is in bytes, transaction length is in bits
  t.tx_buffer = p_data;		// the data is the cmd itself
  t.user = (void*) 1;		// D/C needs to be set to 1 for TX data

  ret = ESP32_SPI_device_polling_transmit(spi_device_handle, &t);

  assert(ret==ESP_OK);
}



/** eigentlich ins ESP32_SPI_Module ? über WriteFn?
 * --------------------------------------------------------------------------------------------------
 *  FName: Write Command List (Write an Command List)
 *  Desc: Reads and sends (polling!) a series of SPI commands/data stored in byte array, incl. delays.
 *  Info: 
 *  Para: ESP32_SPI_Module_spi_device_handle_t spi_device_handle, -> the destination spi device
 *	  const uint8_t *p_addr -> the Command List Table, including delays
 *  Rets: -/-
 * --------------------------------------------------------------------------------------------------
 */
void 
ESP32_SPI_write_cmd_list(ESP32_SPI_device_handle_t p_spi_device_handle,
	const uint8_t* p_addr)
{
  uint8_t numCommands, numArgs, cmd;
  uint16_t ms;

  // read number of commands to follow
  numCommands = *p_addr++;

  // for each command...
  while ( numCommands-- ) {

	// read command
	cmd = *p_addr++;

	// read number of args to follow
	numArgs  = *p_addr++;

	// If high bit set in numArgs, delay time (ms) follows the args
	ms = numArgs & TFT_CMD_DELAY;

	// mask out the delay-info-bit, to get the real number of args
	numArgs &= ~TFT_CMD_DELAY;

	// transfer to spi
	ESP32_SPI_polling_transmit_cmd_and_data(p_spi_device_handle,
		cmd, (uint8_t *) p_addr, numArgs);

	p_addr += numArgs;

	// delay requested ?
	if (ms) {

		// Read post-command data (-> delay time in ms )
		ms = *p_addr++;

		// 255 -> override / special
		if (ms == 255) ms = 500;    // If 255, delay for 500 ms

		// now the delay
		vTaskDelay(ms / portTICK_RATE_MS);
	}
  }
}









